Repository: Bot-wxt1221/glom
Catalog: docs/user-guide/*/*.po
Languages: sv

# _
source: translator-credits
sv: Daniel Nylander <po@danielnylander.se>, 2006 Anders Jonsson <anders.jonsson@norsjovallen.se>, 2017

source: Glom User Guide V0.2
sv: Användarguide för Glom v0.2

source: for Glom v1.6
sv: för Glom v1.6

source: Glom Development Team
sv: Gloms utvecklingsteam

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink type="help" url="ghelp:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
sv: Tillstånd att kopiera, distribuera och/eller modifiera detta dokument ges under villkoren i GNU Free Documentation License (GFDL), version 1.1 eller senare, utgivet av Free Software Foundation utan standardavsnitt och omslagstexter. En kopia av GFDL finns att hämta på denna <ulink type="help" url="ghelp:fdl">länk</ulink> eller i filen COPYING-DOCS som medföljer denna handbok.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
sv: Denna handbok utgör en av flera GNOME-handböcker som distribueras under villkoren i GFDL. Om du vill distribuera denna handbok separat från övriga handböcker kan du göra detta genom att lägga till en kopia av licensavtalet i handboken enligt instruktionerna i avsnitt 6 i licensavtalet.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
sv: Flera namn på produkter och tjänster är registrerade varumärken. I de fall dessa namn förekommer i GNOME-dokumentation - och medlemmarna i GNOME-dokumentationsprojektet är medvetna om dessa varumärken - är de skrivna med versaler eller med inledande versal.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
sv: DOKUMENTET TILLHANDAHÅLLS I "BEFINTLIGT SKICK" UTAN NÅGRA SOM HELST GARANTIER, VARE SIG UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA, INKLUSIVE, MEN INTE BEGRÄNSAT TILL, GARANTIER ATT DOKUMENTET ELLER EN MODIFIERAD VERSION AV DOKUMENTET INTE INNEHÅLLER NÅGRA FELAKTIGHETER, ÄR LÄMPLIGT FÖR ETT VISST ÄNDAMÅL ELLER INTE STRIDER MOT LAG. HELA RISKEN VAD GÄLLER KVALITET, EXAKTHET OCH UTFÖRANDE AV DOKUMENTET OCH MODIFIERADE VERSIONER AV DOKUMENTET LIGGER HELT OCH HÅLLET PÅ ANVÄNDAREN. OM ETT DOKUMENT ELLER EN MODIFIERAD VERSION AV ETT DOKUMENT SKULLE VISA SIG INNEHÅLLA FELAKTIGHETER I NÅGOT HÄNSEENDE ÄR DET DU (INTE DEN URSPRUNGLIGA SKRIBENTEN, FÖRFATTAREN ELLER NÅGON ANNAN MEDARBETARE) SOM FÅR STÅ FÖR ALLA EVENTUELLA KOSTNADER FÖR SERVICE, REPARATIONER ELLER KORRIGERINGAR. DENNA GARANTIFRISKRIVNING UTGÖR EN VÄSENTLIG DEL AV DETTA LICENSAVTAL. DETTA INNEBÄR ATT ALL ANVÄNDNING AV ETT DOKUMENT ELLER EN MODIFIERAD VERSION AV ETT DOKUMENT BEVILJAS ENDAST UNDER DENNA ANSVARSFRISKRIVNING;

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
sv: UNDER INGA OMSTÄNDIGHETER ELLER INOM RAMEN FÖR NÅGON LAGSTIFTNING, OAVSETT OM DET GÄLLER KRÄNKNING (INKLUSIVE VÅRDSLÖSHET), KONTRAKT ELLER DYLIKT, SKA FÖRFATTAREN, DEN URSPRUNGLIGA SKRIBENTEN ELLER ANNAN MEDARBETARE ELLER ÅTERFÖRSÄLJARE AV DOKUMENTET ELLER AV EN MODIFIERAD VERSION AV DOKUMENTET ELLER NÅGON LEVERANTÖR TILL NÅGON AV NÄMNDA PARTER STÄLLAS ANSVARIG GENTEMOT NÅGON FÖR NÅGRA DIREKTA, INDIREKTA, SÄRSKILDA ELLER OFÖRUTSEDDA SKADOR ELLER FÖLJDSKADOR AV NÅGOT SLAG, INKLUSIVE, MEN INTE BEGRÄNSAT TILL, SKADOR BETRÄFFANDE FÖRLORAD GOODWILL, HINDER I ARBETET, DATORHAVERI ELLER NÅGRA ANDRA TÄNKBARA SKADOR ELLER FÖRLUSTER SOM KAN UPPKOMMA PÅ GRUND AV ELLER RELATERAT TILL ANVÄNDNINGEN AV DOKUMENTET ELLER MODIFIERADE VERSIONER AV DOKUMENTET, ÄVEN OM PART SKA HA BLIVIT INFORMERAD OM MÖJLIGHETEN TILL SÅDANA SKADOR.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <_:orderedlist-1/>
sv: DOKUMENTET OCH MODIFIERADE VERSIONER AV DOKUMENTET TILLHANDAHÅLLS UNDER VILLKOREN I GNU FREE DOCUMENTATION LICENSE ENDAST UNDER FÖLJANDE FÖRUTSÄTTNINGAR: <_:orderedlist-1/>

source: <firstname>Murray</firstname> <surname>Cumming</surname> <affiliation> <orgname>Glom Development Team</orgname> <address> <email>murrayc@murrayc.com</email> </address> </affiliation>
sv: <firstname>Murray</firstname> <surname>Cumming</surname> <affiliation> <orgname>Glom-utvecklingsgruppen</orgname> <address> <email>murrayc@murrayc.com</email> </address> </affiliation>

source: <revnumber>Glom 1.6</revnumber> <date>20 June 2004</date> <_:revdescription-1/>
sv: <revnumber>Glom 1.6</revnumber> <date>20 Juni 2004</date> <_:revdescription-1/>

source: This manual describes version 1.6 of Glom
sv: Den här handboken beskriver version 1.6 av Glom

source: Feedback
sv: Återkoppling

source: To report a bug or make a suggestion regarding the Glom or this manual can be submitted to the <ulink url="http://bugzilla.gnome.org" type="http">GNOME Bugzilla </ulink>, under the Glom product. Please search bugzilla before submitting your bug to ensure that yours hasn't already been reported.
sv: Om du vill rapportera ett fel eller göra ett förslag kring Glom eller denna handbok kan de skickas in till <ulink url="http://bugzilla.gnome.org" type="http">GNOME:s Bugzilla </ulink>, under produkten Glom. Sök i Bugzilla innan du skickar in din rapport för att säkerställa att den inte redan rapporterats.

source: User manual for Glom.
sv: Användarhandbok för Glom.

source: Introduction
sv: Introduktion

source: Glom allows you to design and use database systems.
sv: Glom låter dig designa och använda databassystem.

source: Getting Started
sv: Komma igång

source: Starting Glom
sv: Starta Glom

source: You can start <application>Glom</application> in the following ways:
sv: Du kan starta <application>Glom</application> på följande sätt:

source: <guimenu>Applications</guimenu> menu
sv: <guimenu>Program</guimenu>-menyn

source: Choose <menuchoice> <guisubmenu>Office</guisubmenu> <guimenuitem>Glom</guimenuitem> </menuchoice>.
sv: Välj <menuchoice> <guisubmenu>Kontor</guisubmenu> <guimenuitem>Glom</guimenuitem> </menuchoice>.

source: When You Start Glom
sv: Då du startar Glom

source: When you start <application>Glom</application>, the following window is displayed. You may open an existing Glom file or create a new one, possibly basing a new Glom file on one of the examples.
sv: Då du startar <application>Glom</application> visas följande fönster. DU kan öppna en befintlig Glom-fil eller skapa en ny, möjligen genom att basera en ny Glom-fil på ett av exemplen.

source: Glom Start Up Window, Opening an Existing File
sv: Uppstartsfönster för Glom, öppnande av en befintlig fil

source: <imageobject><imagedata fileref="figures/start_open.png" format="PNG"/> </imageobject> <textobject> <phrase>Shows Glom main window used to open an existing Glom file.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/start_open.png" format="PNG"/> </imageobject> <textobject> <phrase>Visar Gloms huvudfönster då det används för att öppna en befintlig Glom-fil.</phrase> </textobject>

source: Glom Start Up Window, Creating a New File
sv: Uppstartsfönster för Glom, skapande av en ny fil

source: <imageobject><imagedata fileref="figures/start_create.png" format="PNG"/> </imageobject> <textobject> <phrase>Shows Glom main window used to create a new Glom file.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/start_create.png" format="PNG"/> </imageobject> <textobject> <phrase>Visar Gloms huvudfönster då det används för att skapa en ny Glom-fil.</phrase> </textobject>

source: Using Glom as an Operator
sv: Använda Glom som en operatör

source: To open an existing Glom document, either open that document from the File Manager, or choose Glom from the Applications menu, and then choose the document when asked. Glom will ask you for a user name and password to access the database. Your administrator will provide your user name and password.
sv: För att öppna ett befintligt Glom-dokument, öppna antingen dokumentet från filhanteraren, eller välj Glom från programmenyn, och välj sedan dokumentet då du tillfrågas. Glom kommer att fråga dig om ett användarnamn och lösenord för att komma åt databasen. Din administratör kommer tillhandahålla ditt användarnamn och lösenord.

source: When you open an existing document, Glom will be in <literal>Operator</literal> <literal>user level</literal>. This user level allows you to find and edit records, but does not allow you to change the fundamental structure of the database.
sv: När du öppnar ett befintligt dokument kommer Glom att vara på <literal>användarnivå</literal>n <literal>Operatör</literal>. Denna användarnivå låter dig hitta och redigera poster, men låter dig inte ändra databasens grundläggande struktur.

source: Navigation
sv: Navigering

source: Each database has several tables. To look at a different table, choose <literal>Tables</literal> from the <literal>Navigate</literal> menu. Then double-click on the table, or select it and click the <literal>Open</literal> button.
sv: Varje databas har flera tabeller. För att titta på en annan tabell, välj <literal>Tabeller</literal> från menyn <literal>Navigera</literal>. Dubbelklicka sedan på tabellen, eller välj den och klicka på knappen <literal>Öppna</literal>.

source: Navigating to a Table
sv: Navigera till en tabell

source: <imageobject><imagedata fileref="figures/glom_tables.png" format="PNG"/> </imageobject> <textobject> <phrase>Navigating to a Table.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_tables.png" format="PNG"/> </imageobject> <textobject> <phrase>Navigera till en tabell.</phrase> </textobject>

source: Viewing and Entering Data
sv: Visa och mata in data

source: When in <literal>Data Mode</literal>, you can view or enter information in either the <literal>List</literal> or <literal>Details</literal> view.
sv: I <literal>Dataläge</literal> kan du visa eller mata in information i antingen vyn <literal>Lista</literal> eller <literal>Detaljer</literal>.

source: The List View
sv: Listvyn

source: The List view shows many records at once and usually shows only the most important fields.
sv: Listvyn visar många poster på en gång och visar vanligen bara de viktigaste fälten.

source: When you enter data into a field it will be saved into the database immediately after you finish editing the field. If it is a date or time field then the data format will be checked for you.
sv: När du matar in data i ett fält kommer det att sparas i databasen så fort du slutar rediga fältet. Om det är ett datum- eller tidsfält kommer dataformatet att kontrolleras åt dig.

source: To create a new record just click the <literal>New</literal> button, or start typing into a field in the last empty row. A new record row will be created with blank fields for you to fill in.
sv: För att skapa en ny post, klicka helt enkelt på knappen <literal>Ny</literal>, eller börja skriva i ett fält i den sista tomma raden. En ny postrad kommer att skapas med tomma fält för dig att fylla i.

source: <imageobject><imagedata fileref="figures/glom_data_list.png" format="PNG"/> </imageobject> <textobject> <phrase>The List View.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_data_list.png" format="PNG"/> </imageobject> <textobject> <phrase>Listvyn.</phrase> </textobject>

source: To sort the records just click on a column header. For instance, you could might click on a date column to list invoices in order of their date, and click again to list them in reverse order.
sv: För att sortera posterna, klicka helt enkelt på ett kolumnhuvud. Till exempel skulle du kunna klicka på en datumkolumn för att lista fakturor i datumordning, och klicka igen för att lista dem i omvänd ordning.

source: The Details View
sv: Detaljvyn

source: The details view shows only one record and usually shows all the fields arranged suitably.
sv: Detaljvyn visar endast en post och visar vanligen alla fält arrangerade på lämpligt sätt.

source: To create a new record just click the <literal>New</literal> button. A new record will be created with blank fields for you to fill in.
sv: För att skapa en ny post, klicka helt enkelt på knappen <literal>Ny</literal>. En ny post kommer att skapas med tomma fält för dig att fylla i.

source: <imageobject><imagedata fileref="figures/glom_data_details.png" format="PNG"/> </imageobject> <textobject> <phrase>The Details View.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_data_details.png" format="PNG"/> </imageobject> <textobject> <phrase>Detaljvyn.</phrase> </textobject>

source: Finding Data
sv: Hitta data

source: Choose <literal>Find Mode</literal> from the Mode menu. The fields in the List and Details views will now be empty, and a Find button will appear at the bottom of the window.
sv: Välj <literal>Sökläge</literal> från lägesmenyn. Fälten i list- och detaljvyerna kommer nu vara tomma, och en sökknapp kommer att visas längst ner i fönstret.

source: Enter information, or part of the information, into a field to find records with that information in that field. For instance, enter Jim into a name field to find records with "Jim" or "Jimmy" in the name.
sv: Ange information, eller del av informationen, i ett fält för att söka poster med den informationen i fältet. Ange till exempel Jim i ett namnfält för att söka poster med ”Jim” eller ”Jimmy” i namnet.

source: When you press the <literal>Find</literal> button, Glom will search for records and then display them. If only one record is found then it will show you that record in the Details view. If several records are found then it will show you those records in the List view.
sv: När du trycker ner knappen <literal>Sök</literal> kommer Glom att söka efter poster och sedan visa dem. Om endast en post hittas kommer det att visa den posten i detaljvyn. Om flera poster hittas kommer det att visa dig de posterna i listvyn.

source: Printing Reports
sv: Skriva ut rapporter

source: If your database developer has defined some reports for a table then you will seem them listed in the <literal>Reports</literal> menu. Just choose the report from the menu to create the report. If you have previously performed a search then the report will contain only the currently-found data. Otherwise it will contain all data in the current report. Remember that each table has its own reports so you may need to switch to the relevant table to use a particular report.
sv: Om din databasutvecklare har definierat rapporter för en tabell så kommer du att se dem listade i menyn <literal>Rapporter</literal>. Välj helt enkelt rapporten från menyn för att skapa rapporten. Om du tidigare har utfört en sökning kommer rapporten bara att innehålla de data som hittats för tillfället. I annat fall kommer alla data finnas i den aktuella rapporten. Kom ihåg att varje tabell har sina egna rapporter, så du kan behöva byta till den relevanta tabellen för att använda en specifik rapport.

source: A report
sv: En rapport

source: <imageobject><imagedata fileref="figures/glom_report_result.png" format="PNG"/> </imageobject> <textobject> <phrase>A report.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_report_result.png" format="PNG"/> </imageobject> <textobject> <phrase>En rapport.</phrase> </textobject>

source: Using Glom as a Developer
sv: Använda Glom som en utvecklare

source: When you create a new document, Glom will be in the <literal>Developer</literal> <literal>user level</literal>. You can also change to the Developer user level after opening an existing document, with the <literal>User Level</literal> menu. Glom will only allow this if the administrator has allowed it.
sv: När du skapar ett nytt dokument kommer Glom att vara på <literal>användarnivå</literal>n <literal>Utvecklare</literal>. Du kan också byta till användarnivån utvecklare efter att ha öppnat ett befintligt dokument, med menyn <literal>användarnivå</literal>. Glom kommer endast att tillåta detta om administratören har tillåtit det.

source: Adding Tables
sv: Lägga till tabeller

source: You can see the list of existing tables by choosing <literal>Tables</literal> from the <literal>Navigate</literal> menu. You will also see this window after connecting to a database server, after creating a new document. To create a new table, click the <literal>Add</literal> button and enter the name for the new table. Glom will suggest a human-readable title for this table. <literal>Operators</literal> will see this title instead of the actual table name. You can also mark a tables as <literal>hidden</literal> from Operators. For instance, Operators should see "Invoice Lines" as related records from the "Invoices" table, but they should never be able to navigate directly to the "Invoice Lines" table.
sv: Du kan se listan över befintliga tabeller genom att välja <literal>Tabeller</literal> från menyn <literal>Navigera</literal>. Du kommer också att se detta fönster efter att ha anslutit till en databasserver och efter att ha skapat ett nytt dokument. För att skapa en ny tabell, klicka på knappen <literal>Lägg till</literal> och ange namnet på den nya tabellen. Glom kommer att föreslå en läsbar titel för denna tabell. <literal>Operatörer</literal> kommer att se denna titel istället för tabellens faktiska namn. Du kan också markera en tabell som <literal>dold</literal> från operatörer. Till exempel bör operatörer se "Fakturarader" som relaterade poster från tabellen "Fakturor", men bör aldrig kunna navigera direkt till tabellen "Fakturarader".

source: You can also specify one table as the <literal>default table</literal>. This table will be shown whenever an operator opens an existing document, without asking him to select a table from the list.
sv: Du kan också ange en tabell som <literal>standardtabell</literal>. Denna tabell kommer att visas när en operatör öppnar ett befintligt dokument, utan någon fråga om att välja en tabell från listan.

source: You can also use this window to rename an existing table.
sv: Du kan också använda detta fönster för att byta namn på en befintlig tabell.

source: Click the <literal>Open</literal> button to look at the selected table.
sv: Klicka på knappen <literal>Öppna</literal> för att titta på den valda tabellen.

source: Editing Fields
sv: Redigera fält

source: Choose <literal>Fields</literal> from the <literal>Developer</literal> menu. This shows the list of fields in the table. New tables automatically have a primary key field, but you can change this field if necessary.
sv: Välj <literal>Fält</literal> från menyn <literal>Utvecklare</literal>. Detta visar listan över fält i tabellen. Nya tabeller har automatiskt ett primärnyckelfält, men du kan ändra detta fält om nödvändigt.

source: Click the <literal>Add</literal> button to add a new field, then enter the name of the new field. Glom will guess an appropriate human-readable title for this field, but you can edit this. <literal>Operators</literal> will see this title instead of the actual field name.
sv: Klicka på knappen <literal>Lägg till</literal> för att lägga till ett nytt fält, och ange sedan namnet på det nya fältet. Glom kommer att gissa en lämplig titel som är läsbar för människor för detta fält, men du kan redigera detta. <literal>Operatörer</literal> kommer att se denna titel istället för fältets faktiska namn.

source: To specify more field details, select the field and click the <literal>Details</literal> button.
sv: För att ange fler detaljer för fältet, välj fältet och klicka på knappen <literal>Detaljer</literal>.

source: <imageobject><imagedata fileref="figures/glom_design_fields.png" format="PNG"/> </imageobject> <textobject> <phrase>Editing the table's fields.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_fields.png" format="PNG"/> </imageobject> <textobject> <phrase>Redigera tabellens fält.</phrase> </textobject>

source: Primary Keys
sv: Primärnycklar

source: Each table must have one, and only one, <literal>Primary Key</literal>. The value in this field will be unique, meaning that each value in this field will appear in only one record in the table. For instance, each record in a "Customers" table would have a "Customer ID". This value will be used to refer to that customer from other tables, such as "Projects" and "Invoices" records. See the <link linkend="sec-developer-relationships">Creating Relationships</link> section to see how you can relate tables together.
sv: Varje tabell måste ha exakt en <literal>primärnyckel</literal>. Värdet i detta fält kommer vara unikt, vilket betyder att varje värde i detta fält endast dyker upp i en post i tabellen. Till exempel skulle varje post i en "Kunder"-tabell ha ett "Kund-ID". Detta värde kommer användas för att hänvisa till den kunden från andra tabeller, så som poster för "Projekt" och "Fakturor". Se avsnittet <link linkend="sec-developer-relationships">Skapa relationer</link> för att se hur du kan skapa relationer mellan tabeller.

source: Field Types
sv: Fälttyper

source: Number
sv: Tal

source: Date
sv: Datum

source: Time
sv: Tid

source: Boolean - either true or false
sv: Boolesk - antingen sant eller falskt

source: Image
sv: Bild

source: Glom offers a few simple field types: <_:orderedlist-1/>
sv: Glom erbjuder några få enkla fälttyper: <_:orderedlist-1/>

source: Calculated Fields
sv: Beräknade fält
