Repository: Bot-wxt1221/glom
Catalog: docs/user-guide/*/*.po
Languages: sv

source: Window: Imageobject
sv: Fönster: Bildobjekt

source: Dialog: Notebook
sv: Dialogruta: Flikhäfte

source: Dialog: Data invalid format
sv: Dialogruta: Ogiltigt format för data

source: Dialog: Relationship overview
sv: Dialogruta: Relationsöversikt

source: Window: Groups
sv: Fönster: Grupper

source: Dialog: Group by sort fields
sv: Dialogruta: Gruppera efter sorteringsfält

source: Dialog: Group by secondary fields
sv: Dialogruta: Gruppera efter sekundära fält

source: Window: Button script
sv: Fönster: Knappskript

source: Window: Field calculation
sv: Fönster: Fältberäkning

source: Dialog: New group
sv: Dialogruta: Ny grupp

source: Dialog: Choose user
sv: Dialogruta: Välj användare

source: Dialog: User
sv: Dialogruta: Användare

source: Dialog: Translation identify original
sv: Dialogruta: Identifiera ursprunglig översättning

source: Dialog: Translation copy
sv: Dialogruta: Översättningskopia

source: Dialog: Choose Date
sv: Dialogruta: Välj datum

source: Dialog: Import Into Table
sv: Dialogruta: Importera till tabell

source: This dialog allows the user to import a CSV (comma separated value) file into the current database table. It shows the first few rows of the file to import and allows the user to select the target field in the database for each column in the CSV file. For auto-incremented primary keys, the primary key field cannot be used as a target field, but otherwise one column must be imported into the primary key field.
sv: Denna dialogruta låter användaren importera en CSV-fil (med kommaseparerade värden) till den aktuella databastabellen. Den visar de första raderna i filen som ska importeras och låter användaren välja målfältet i databasen för varje kolumn i CSV-filen. För automatiskt ökade primärnycklar kan primärnyckelfältet inte användas som ett målfält, men i annat fall måste en kolumn importeras till primärnyckelfältet.

source: About Glom
sv: Om Glom

source: Glom is maintained by Glom and GNOME community volunteers. To find more information about Glom, please visit the <ulink url="http://www.glom.org/" type="http">Glom Web site</ulink>.
sv: Glom underhålls av frivilliga från Glom- och GNOME-gemenskapen. För att få mer information om Glom, besök <ulink url="http://www.glom.org/" type="http">Gloms webbplats</ulink>.

source: To report a bug or make a suggestion regarding this application or this manual, you can submit them using <ulink url="http://bugzilla.gnome.org" type="help">bugzilla</ulink>.
sv: För att rapportera ett fel eller komma med ett förslag kring detta program eller denna handbok kan du skicka in dem med <ulink url="http://bugzilla.gnome.org" type="help">bugzilla</ulink>.

source: Another excellent source of information are the Glom <ulink url="http://www.glom.org" type="http">mailing lists</ulink>.
sv: En annan utmärkt informationskälla är Gloms <ulink url="http://www.glom.org" type="http">sändlistor</ulink>.

source: This program is distributed under the terms of the GNU General Public license as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. A copy of this license can be found at this <ulink url="ghelp:gpl" type="help">link</ulink>, or in the file COPYING included with the source code of this program.
sv: Det här programmet distribueras under villkoren för GNU General Public License som publicerats av Free Software Foundation; antingen version 2 av licensen, eller (om du så vill) någon senare version. En kopia av den här licensen kan hittas på den här <ulink url="ghelp:gpl" type="help">länken</ulink>, eller i filen COPYING som inkluderats i källkoden för det här programmet.

source: Concepts
sv: Koncept

source: <literal>Database</literal>: Each Glom document allows access to one database.
sv: <literal>Databas</literal>: Varje Glom-dokument tillåter åtkomst till en databas.

source: <literal>Table</literal>: Each database contains several tables, such as "Customers" and "Invoices" tables.
sv: <literal>Tabell</literal>: Varje databas innehåller flera tabeller, så som tabeller för "Kunder" and "Fakturor".

source: <literal>Field</literal>: Each table has several fields, such as "Customer ID", "First Name", and "Date of Birth" fields. In other documents and applications, fields are sometimes called "Columns"
sv: <literal>Fält</literal>: Varje tabell har flera fält, så som fält för "Kund-ID", "Förnamn" och "Födelsedatum". I andra dokument och program kallas fält ibland för "Kolumner"

source: <literal>Records</literal>: Each table contains several records, each of which has values for each of the fields. For instance, the "Customers" table will have a record for each customer. In other documents and applications, records are sometimes called <literal>Rows</literal>.
sv: <literal>Poster</literal>: Varje tabell innehåller flera poster, vilka var och en har värden för vart och ett av fälten. Till exempel kommer tabellen "Kunder" att ha en post för varje kund. I andra dokument och program kallas poster ibland för <literal>Rader</literal>.

source: <literal>Relationships</literal>: Each table might be related to other tables, via fields in both tables. For instance, a "Customers" table could have a relationship to the "Invoices" table, so that people could see all the invoices for that customer. Only developers need to understand this concept. In other documents and applications, relationships are sometimes called "Joins".
sv: <literal>Relationer</literal>: Varje tabell kan vara relaterad till andra tabeller via fält som finns i båda tabellerna. Till exempel kan tabellen "Kunder" ha en relation till tabellen "Fakturor", så att folk kan se alla fakturor för den kunden. Endast utvecklare behöver förstå detta koncept. I andra dokument och program kallas en relation ibland "Join".

source: Glom is easy to use, but you must understand the following basic concepts. <_:orderedlist-1/>
sv: Glom är lättanvänt, men du måste förstå följande grundläggande koncept. <_:orderedlist-1/>

source: Calculated fields and button scripts
sv: Beräknade fält och knappskript

source: Calculated fields and button scripts use the Python programming language. The calculation or script is the implementation of a function whose signature is provided for you.
sv: Beräknade fält och knappskript använder programmeringsspråket Python. Beräkningen eller skriptet är implementationen av en funktion vars signatur tillhandahålls åt dig.

source: Editing the definition of a calculated field
sv: Redigera definitionen för ett beräknat fält

source: <imageobject><imagedata fileref="figures/glom_design_fields_dialog_calculated.png" format="PNG"/> </imageobject> <textobject> <phrase>Editing the definition of a calculated field.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_fields_dialog_calculated.png" format="PNG"/> </imageobject> <textobject> <phrase>Redigera definitionen för ett beräknat fält.</phrase> </textobject>

source: Field values
sv: Fältvärden

source: For instance, <_:programlisting-1/> is the value of the name_first field in the current record.
sv: Till exempel är <_:programlisting-1/> värdet på fältet name_first i den aktuella posten.

source: Related Records
sv: Relaterade poster

source: For instance, <_:programlisting-1/> provides the related records for the current record.
sv: Till exempel tillhandahåller <_:programlisting-1/> de relaterade posterna för aktuell post.

source: Single related records
sv: Enkla relaterade poster

source: For relationships that specify a single record, you can get the value of a field in that record. For instance, <_:programlisting-1/> is the value of the name field in the table indicated by the location relationship (often called location::name).
sv: För relationer som anger en ensam post kan du få värdet på ett fält i den posten. Till exempel är <_:programlisting-1/> värdet på namnfältet i tabellen som indikeras av platsrelationen (ofta kallad location::name).

source: Multiple related records
sv: Flera relaterade poster

source: For relationships that specify multiple records, you can use the aggregate functions (sum, count, average) to get overall values. For instance, <_:programlisting-1/>.
sv: För relationer som anger flera poster kan du använda aggregatfunktionerna (sum, count, average) för att få generella värden. Till exempel, <_:programlisting-1/>.

source: Testing for empty values
sv: Testa för tomma värden

source: How you test for empty values depends on the type of field:
sv: Hur du testar efter tomma värden beror på fältets typ:

source: Non-text fields
sv: Icke-textfält

source: Non-text fields may be empty, indicating that the user has not entered any value in the field. For instance, Glom does not assume that an empty value in a numeric field should mean 0.
sv: Icke-textfält kan vara tomma, vilket indikerar att användaren inte har matat in något värde i fältet. Till exempel antar inte Glom att ett tomt värde i ett numeriskt fält betyder 0.

source: You can test whether a field is empty by using Python's None. For instance:
sv: Du kan testa om ett fält är tomt genom att använda Pythons None. Till exempel:

source: if(record["contact_id"] == None): return "No Contact" else: return record.related["contacts"]["name_full"]
sv: if(record["contact_id"] == None): return "Ingen kontakt" else: return record.related["contacts"]["name_full"]

source: You might also test whether there are any related records. For instance:
sv: Du kan också testa huruvida det finns relaterade poster. Till exempel:

source: if(record.related["contacts"] == None): return "No Contact" else: return record.related["contacts"]["name_full"]
sv: if(record.related["contacts"] == None): return "Ingen kontakt" else: return record.related["contacts"]["name_full"]

source: Text fields
sv: Textfält

source: For text fields, you should check for zero-length strings. It is not possible in Glom to distinguish between zero-length strings and the absence of any string, because there is no advantage to doing so. For instance:
sv: För textfält ser du om strängar har längden noll. Det är inte möjligt i Glom att skilja mellan strängar av längden noll och avsaknad av en sträng, detta för att det inte finns någon fördel i att göra så. Till exempel:

source: if(record["name_full"] == ""): return "No Name" else: return record["name_full"]
sv: if(record["name_full"] == ""): return "Inget namn" else: return record["name_full"]

source: Using the full pygda API
sv: Använda det fullständiga pygda-API:t

source: pygda is a python API for the libgda API. The record's <literal>connection</literal> attribute provides a gda.connection that can be used to access the current database directly. This allows you to run any SQL query, for instance to read data from the database with a SELECT, or to change values in the database with an UPDATE. Note that the connection is already open so you can avoid the difficult work of specifying the connection details.
sv: pygda är ett python-API för libgda-API:t. Postens attribut <literal>connection</literal> tillhandahåller en gda.connection som kan användas för att komma åt den aktuella databasen direkt. Detta låter dig köra valfri SQL-fråga, till exempel för att läsa data från databasen med SELECT, eller för att ändra värden i databasen med UPDATE. Observera att anslutningen redan är öppen, så du kan undvika det svåra jobbet med att ange anslutningsdetaljerna.

source: The record's <literal>table_name</literal> attribute also provides the name of the current table.
sv: Attributet <literal>table_name</literal> för posten tillhandahåller också namnet på den aktuella tabellen.

source: This example reads all data from the current table and prints the values to the terminal:
sv: Detta exempel läser alla data från den aktuella tabellen och skriver ut värdena till terminalen:

source: # Use the current database's connection # to get all the data for the current table. # # record.connection is an already-open gda.connection object, # saving us the bother of opening the connection, # or even knowing the name of the database. query = "SELECT * FROM %s" % record.table_name data_model = gda.gda_execute_select_command(record.connection, query) rows = data_model.get_n_rows() columns = data_model.get_n_columns() print " Number of columns: ", columns for i in range(columns): print " column ", i; print " name=", data_model.get_column_title(i) # Find out whether it's the primary key: field = data_model.describe_column(i) if field.get_primary_key(): print " (primary key)" print "\n"; print " Number of rows: ", rows for row_index in range(rows): print " row ", row_index; for col_index in range(columns): print " value=", data_model.get_value_at(col_index, row_index).get() print "\n";
sv: # Använd den aktuella databasens anslutning # för att få alla data för aktuell tabell. # # record.connection är ett öppet gda.connection-objekt, # vilket besparar oss besväret med att öppna anslutningen, # eller ens att veta databasens namn. query = "SELECT * FROM %s" % record.table_name data_model = gda.gda_execute_select_command(record.connection, query) rows = data_model.get_n_rows() columns = data_model.get_n_columns() print " Antal kolumner: ", columns for i in range(columns): print " kolumn ", i; print " namn=", data_model.get_column_title(i) # Ta reda på om det är primärnyckeln: field = data_model.describe_column(i) if field.get_primary_key(): print " (primärnyckel)" print "\n"; print " Antal rader: ", rows for row_index in range(rows): print " rad ", row_index; for col_index in range(columns): print " värde=", data_model.get_value_at(col_index, row_index).get() print "\n";

source: link
sv: länk

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <_:ulink-1/> or in the file COPYING-DOCS distributed with this manual.
sv: Tillstånd att kopiera, distribuera och/eller modifiera detta dokument ges under villkoren i GNU Free Documentation License (GFDL), version 1.1 eller senare, utgivet av Free Software Foundation utan standardavsnitt och omslagstexter. En kopia av GFDL finns att hämta på denna <_:ulink-1/> eller i filen COPYING-DOCS som medföljer denna handbok.
