Repository: Bot-wxt1221/glom
Catalog: docs/user-guide/*/*.po
Languages: sv

source: Field values can be calculated in terms of other fields, using the Python programming language. This calculation should be the implementation of a python function, which should return a value. The return value will be used as the value of the field. This value will be recalculated every time one of the source fields changes. TODO: This only works for default values at the moment, and you can not use field values in the calculation yet.
sv: Fältvärden kan beräknas beroende på andra fält, med programmeringsspråket Python. Denna beräkning ska vara implementationen av en Python-funktion som ska returnera ett värde. Returvärdet kommer användas som fältets värde. Detta värde kommer att beräknas på nytt varje gång ett av källfälten ändras. ATT GÖRA: Detta fungerar för närvarande bara för standardvärden, och du kan inte använda fältvärden i beräkningen ännu.

source: You can also use calculations to specify a default value for fields, by selecting the <literal>Default Value</literal> tab in the <literal>Field Details</literal> window, clicking on the <literal>Calculate Value</literal> check box, and then entering a Python calculation. You can test this calculation in the <literal>Edit</literal> window.
sv: Du kan också använda beräkningar för att ange ett standardvärde för fält, genom att välja fliken <literal>Standardvärde</literal> i fönstret <literal>Fältdetaljer</literal> och klicka på kryssrutan <literal>Beräkna värde</literal>, och sedan ange en Python-beräkning. Du kan testa denna beräkning i fönstret <literal>Redigera</literal>.

source: Arranging Layouts
sv: Arrangera layouter

source: Each table has <literal>List</literal> and <literal>Details</literal> views, and by default these show all fields in the table, in order of creation. You can edit the layout by choosing <literal>Layout</literal> from the <literal>Developer</literal> menu.
sv: Varje tabell har vyer för <literal>Lista</literal> och <literal>Detaljer</literal>, och som standard visar dessa alla fält i tabellen i den ordning de skapades. Du kan redigera layouten genom att välja <literal>Layout</literal> från menyn <literal>Utvecklare</literal>.

source: Arranging the List View
sv: Arrangera listvyn

source: For the <literal>List</literal> view, you can specify the sequence of field columns, and whether some fields are hidden.
sv: För vyn <literal>Lista</literal> kan du ange sekvensen av fältkolumner och huruvida några fält är dolda.

source: Editing the List Layout
sv: Redigera listlayouten

source: <imageobject><imagedata fileref="figures/glom_design_layout_list.png" format="PNG"/> </imageobject> <textobject> <phrase>Editing the list layout.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_layout_list.png" format="PNG"/> </imageobject> <textobject> <phrase>Redigera listlayouten.</phrase> </textobject>

source: Arranging the Details View
sv: Arrangera detaljvyn

source: For the <literal>Details</literal> view, you can create groups of fields, and give these groups titles. You can then place fields in these groups and specify the sequence fo fields in these groups. You can also specify the sequence of these groups. For instance, in a "Contacts" table, you might create a "Name" group, and place the "title", "first_name" and "last_name" fields in that group. You might have other groups for the "Address" fields.
sv: För vyn <literal>Detaljer</literal> kan du skapa grupper av fält och ge dessa grupper titlar. Du kan sedan placera fält i dessa grupper och ange ordningen för fält i dessa grupper. Du kan också ange ordningen på dessa grupper. Till exempel kanske du skapar en grupp "Namn" i tabellen "Kontakter", och placerar fälten "titel", "förnamn" och "efternamn" i den gruppen. Du kan ha andra grupper för "Adress"-fälten.

source: Editing the details Layout
sv: Redigera detaljlayouten

source: <imageobject><imagedata fileref="figures/glom_design_layout_details.png" format="PNG"/> </imageobject> <textobject> <phrase>Editing the Details Layout.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_layout_details.png" format="PNG"/> </imageobject> <textobject> <phrase>Redigera detaljlayouten.</phrase> </textobject>

source: Creating Relationships
sv: Skapa relationer

source: Tables in the Database are often related together. For instance, an "Invoices" table might have a "Customer ID" field. A value in this field would specify a record in the "Customers" table with the same value. Glom can show extra information, such as the customer name, from that related record. Or it can show a list of several related records - for instance, several related "Invoice Lines" that are related to a record in the "Invoice" record.
sv: Tabeller i databasen är ofta relaterade med varandra. Till exempel kan en tabell "Fakturor" ha ett fält "Kund-ID". Ett värde i detta fält skulle ange en post i tabellen "Kunder" med samma värde. Glom kan visa extra information, så som kundnamnet, från den relaterade posten. Eller så kan det visa en lista över flera relaterade poster - till exempel flera relaterade "Fakturarader" som är relaterade till en post i "Faktura"-posten.

source: To create relationships, choose <literal>Relationships</literal> from the <literal>Developer</literal> menu. This will show the list of existing relationships. Click the <literal>Add</literal> button to create a new relationship, and enter a name for it. You should then choose a field in the current table, and a field in another table to which it should be related. This relationship will find any records in the other table for which the values in both fields are equal.
sv: För att skapa relationer, välj <literal>Relationer</literal> från menyn <literal>Utvecklare</literal>. Detta kommer att visa listan över befintliga relationer. Klicka på knappen <literal>Lägg till</literal> för att skapa en ny relation och ange ett namn för den. Du väljer sedan ett fält i den aktuella tabellen och ett fält i en annan tabell som det ska vara relaterat till. Denna relation kommer att hitta alla poster i den andra tabellen för vilka värdena i båda fälten är lika.

source: To show a related field on the List or Details view.
sv: För att visa ett relaterat fält i list- eller detaljvyn.

source: To show a list of related records on the Details view.
sv: För att visa en lista över relaterade fält i detaljvyn.

source: To lookup a value from a field in a related record. For instance, to copy the current price of a "Product" into the "Price" field of an "Invoice Line" record.
sv: För att slå upp ett värde från ett fält i en relaterad post. Till exempel för att kopiera aktuellt pris för en "Produkt" till fältet "Pris" för en "Fakturarad"-post.

source: To calculate a field value.
sv: För att beräkna ett fälts värde.

source: You can use the relationship in the following places. <_:orderedlist-1/>
sv: Du kan använda relationen på följande platser. <_:orderedlist-1/>

source: Users Administration
sv: Användaradministration

source: To define the <literal>Operators</literal> who can use your database, and to specify what access they have to the various tables, choose <literal>Users</literal> from the <literal>Developer</literal> menu.
sv: För att definiera <literal>Operatörer</literal> som kan använda din databas, och för att ange vilken åtkomst de har till de olika tabellerna, välj <literal>Användare</literal> från menyn <literal>Utvecklare</literal>.

source: Translations
sv: Översättningar

source: Glom's user interface (and this document) is translated into several languages, as you should see already if you are using your computer with a non-English user interface. In addition, Glom automatically shows and understands numbers and dates according to the current user's local conventions. For instance, a user in the USA might enter a price as 1.99 and a date as 1/13/2008, but a German user of the same database will later see that as 1,99 and 13.1.2008.
sv: Gloms användargränssnitt (och detta dokument) har översatts till flera språk, som du redan bör se om du använder din dator med ett annat användargränssnitt än engelska. Dessutom visar och förstår Glom automatiskt siffror och datum enligt den aktuella användarens lokalkonventioner. Till exempel kan en användare i USA ange ett pris som 1.99 och ett datum som 1/13/2008, men en tysk användare av samma databas kommer senare att se det som 1,99 och 13.1.2008.

source: However, the Glom system that you create also contains text that must be translated if it will be used by people who speak different languages. For instance, you must provide translations for the titles of your tables, fields, and reports. All of these text items can be seen in a list when you choose <literal>Translations</literal> from the <literal>Developer</literal> menu. In this window you can specify the language that you used for the original text, and enter translations for each text item for additional languages. When the Glom system is opened by a user of that language then these text items will be shown in the user interface.
sv: Glom-systemet som du skapar innehåller dock också text som måste översättas om det ska användas av personer som talar olika språk. Till exempel måste du tillhandahålla översättningar för titlarna för dina tabeller, fält och rapporter. Alla dessa textobjekt kan ses i en lista när du väljer <literal>Översättningar</literal> från menyn <literal>Utvecklare</literal>. I detta fönster kan du ange språket som du använde för originaltexten, och mata in översättningar för varje textobjekt för ytterligare språk. När Glom-systemet öppnas av en användare av det språket kommer dessa textobjekt att visas i användargränssnittet.

source: <imageobject><imagedata fileref="figures/glom_design_translations.png" format="PNG"/> </imageobject> <textobject> <phrase>Translations.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_translations.png" format="PNG"/> </imageobject> <textobject> <phrase>Översättningar.</phrase> </textobject>

source: Experienced translators may be more familiar with the .po file format, or you might wish to use the many tools that work with the .po file format. By using the <literal>Export</literal> button you can create a .po file to use in a separate tool or to send to a translator. You can then import the resulting translation by using the <literal>Import</literal> button.
sv: Erfarna översättare kan vara mer vana med .po-filformatet, eller så kanske du vill använda de många verktyg som fungerar med .po-filformatet- Genom att använda knappen <literal>Exportera</literal> kan du skapa en .po-fil att använda i ett separat verktyg eller att skicka till en översättare. Du kan sedan importera den resulterande översättningen genom att använda knappen <literal>Importera</literal>.

source: Defining Reports
sv: Definiera rapporter

source: Adding or Editing Reports
sv: Lägga till eller redigera rapporter

source: Glom can produce reports to show specific fields for sets of records, sorted and grouped. For instance, a shop might need a report listing all products sold in one month, grouped by product type, and sorted by price inside each group. Each table has its own reports, which are available to the operator from the <literal>Reports</literal> menu.
sv: Glom kan producera rapporter för att visa specifika fält för uppsättningar av poster, sorterade och grupperade. Till exempel kan en affär behöva en rapport som listar alla produkter som sålts under en månad, grupperade efter produkttyp, och sorterade efter pris inom varje grupp. Varje tabell har sina egna rapporter, vilka är tillgängliga för operatören från menyn <literal>Rapporter</literal>.

source: To define a report, or to change the definition of an existing report, choose <literal>Reports</literal> from the <literal>Developer</literal> menu.
sv: För att definiera en rapport, eller för att ändra definitionen på en befintlig rapport, välj <literal>Rapporter</literal> från menyn <literal>Utvecklare</literal>.

source: Creating or Editing Reports
sv: Skapa eller redigera rapporter

source: <imageobject><imagedata fileref="figures/glom_design_reports.png" format="PNG"/> </imageobject> <textobject> <phrase>Creating or editing reports.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_reports.png" format="PNG"/> </imageobject> <textobject> <phrase>Skapa eller redigera rapporter.</phrase> </textobject>

source: Notice that each report has an ID as well as a human-readable name. This allows your report to have a translated title when used on a computer that uses a different language.
sv: Observera att varje rapport har ett ID förutom ett namn läsbart för människor. Detta låter din rapport ha en översatt titel då den används på en dator som använder ett annat språk.

source: Editing a Report
sv: Redigera en rapport

source: The Header, which appears at the start of the report
sv: Sidhuvudet, vilket visas i början på rapporten

source: The Main area, in which the records and summary lines are shown, with the actual data from the database.
sv: Huvudområdet, i vilket posterna och sammanfattningsraderna visas, med faktiska data från databasen.

source: The Footer, which appears at the end of the report.
sv: Sidfoten, vilken visas i slutet på rapporten.

source: A Glom report has three areas: <_:orderedlist-1/>
sv: En Glom-rapport har tre områden: <_:orderedlist-1/>

source: Inside an area, such as the Main part, you may add report <literal>Parts</literal>, such as fields, text, or images. These will usually appear in a row on the printed report, with one row for each record. In the simple case, this will look much like Glom's list view. You can add parts to your report by selecting them from the <literal>Available Parts</literal> list and then clicking the <literal>Add</literal> button. The part will then be added to the <literal>Parts</literal> list, in the selected area.
sv: Inuti ett område, så som huvuddelen, kan du lägga till <literal>Delar</literal> till rapporten, så som fält, text eller bilder. Dessa kommer vanligen visas i en rad på den utskrivna rapporten, med en rad för varje post. I enkla fall kommer detta vara väldigt likt Gloms listvy. Du kan lägga till delar till din rapport genom att välja dem från listan <literal>Tillgängliga delar</literal> och sedan klicka på knappen <literal>Lägg till</literal>. Delen kommer sedan läggas till i listan <literal>Delar</literal> i det valda området.

source: To specify details for the parts, such as the text or image to display, or to choose the field to display, select the part in the <literal>Parts</literal> list and click the <literal>Edit</literal> button. You may also specify field formatting by clicking the <literal>Formatting</literal> button, just as you would when defining a details or list layout.
sv: För att ange detaljer för delarna, så som texten eller bilden som ska visas, eller för att välja fältet som ska visas, välj delen i listan <literal>Delar</literal> och klicka på knappen <literal>Redigera</literal>. Du kan också ange fältets formatering genom att klicka på knappen <literal>Formatering</literal>, precis som du gör då du definierar en detalj- eller listlayout.

source: <imageobject><imagedata fileref="figures/glom_design_reports_details.png" format="PNG"/> </imageobject> <textobject> <phrase>Editing a report.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_reports_details.png" format="PNG"/> </imageobject> <textobject> <phrase>Redigera en rapport.</phrase> </textobject>

source: Some parts may contain other parts and have extra properties to control how they present their child parts. For instance, the <literal>Group By</literal> part groups records together by a field. For instance, a products report might group a list of products by product type. You can even add a second sub-grouping inside the main <literal>Group By</literal> part, by selecting your top-level <literal>Group By</literal> part in the <literal>Parts</literal> list while adding a new <literal>Group By</literal> part from the <literal>Available Parts</literal> list. For instance, you might group your products by manufacturer, inside each product type group.
sv: Vissa delar kan innehålla andra delar och ha extra egenskaper för att styra hur de presenterar sina underordnade delar. Till exempel grupperar delen <literal>Gruppera efter</literal> poster tillsammans enligt ett fält. Till exempel kan en produktrapport gruppera en lista över produkter efter produkttyp. Du kan till och med lägga till en andra undergruppering inuti den huvudsakliga <literal>Gruppera efter</literal>-delen genom att välja din <literal>Gruppera efter</literal>-del på toppnivån i listan <literal>Delar</literal> medan du lägger till en ny <literal>Gruppera efter</literal>-del från listan <literal>Tillgängliga delar</literal>. Till exempel kan du gruppera dina produkter efter tillverkare inuti varje produkttypsgrupp.

source: To specify the field by which the records should be grouped, select your <literal>Group By</literal> part in the <literal>Parts</literal> list and click the <literal>Edit</literal> button. You can then choose the field by which the records should be grouped, and select the fields by which these records should be sorted within the group. You may also specify some additional fields to be displayed in the group's title row. For instance, you might want to group products by a manufacturer ID, but also show the manufacturer name.
sv: För att ange fältet efter vilket posterna ska grupperas väljer du din <literal>Gruppera efter</literal>-del i listan <literal>Delar</literal> och klickar på knappen <literal>Redigera</literal>. Du kan sedan välja fältet som posterna ska grupperas efter, och välja fälten efter vilka dessa poster ska sorteras inom gruppen. Du kan också ange ytterligare fält som ska visas i gruppens titelrad. Till exempel kan du vilja gruppera produkter efter ett tillverkar-ID, men också visa tillverkarens namn.

source: Editing a Group By Part
sv: Redigera en grupp efter del

source: <imageobject><imagedata fileref="figures/glom_design_reports_group_by.png" format="PNG"/> </imageobject> <textobject> <phrase>Editing a report.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_reports_group_by.png" format="PNG"/> </imageobject> <textobject> <phrase>Redigera en rapport.</phrase> </textobject>

source: The <literal>Vertical Group</literal> part may contain other items. For instance, it allows you to arrange fields below each other instead of just one after the other in the horizontal row. This is useful for grouping related fields such as address lines, or just to squeeze more information into the records's row on the report.
sv: Delen <literal>Vertikal grupp</literal> kan innehålla andra objekt. Till exempel låter den dig arrangera fält under varandra i stället för ett efter ett i den horisontella raden. Detta är användbart för att gruppera relaterade fält som adressrader, eller för att helt enkelt klämma in mer information i postens rad i rapporten.

source: A Report with Vertical Groups
sv: En rapport med vertikala grupper

source: <imageobject><imagedata fileref="figures/glom_design_reports_vertical_group.png" format="PNG"/> </imageobject> <textobject> <phrase>A Report with Vertical Groups.</phrase> </textobject>
sv: <imageobject><imagedata fileref="figures/glom_design_reports_vertical_group.png" format="PNG"/> </imageobject> <textobject> <phrase>En rapport med vertikala grupper.</phrase> </textobject>

source: When you have finished, click the <literal>Close</literal> button to save the report's definition. Your report can then be chosen from the <literal>Reports</literal> menu. See the <link linkend="glom-operator-printing-reports">Printing Reports</link> section for more details.
sv: Då du är klar, klicka på knappen <literal>Stäng</literal> för att spara rapportens definition. Din rapport kan sedan väljas från menyn <literal>Rapporter</literal>. Se avsnittet <link linkend="glom-operator-printing-reports">Skriva ut rapporter</link> för mer detaljer.

source: Dialogs
sv: Dialogrutor

source: Dialog: Initial dialog
sv: Dialogruta: Ursprunglig dialogruta

source: This dialog allows the user to choose an existing document or create a new document. Existing documents may be selecting from the list of recently opened documents or by select a file with the file chooser dialog. Documents can also be opened via the network if other users are running Glom on the local network. Finally, a new document can be created either by opening a template file which already contains some initial tables and records, or by creating an empty document.
sv: Denna dialogruta låter användaren välja ett befintligt dokument eller skapa ett nytt dokument. Befintliga dokument kan väljas från listan över senast öppnade dokument eller genom att välja en fil med filväljardialogen. Dokument kan också öppnas via nätverket om andra användare kör Glom på det lokala nätverket. Slutligen kan ett nytt dokument skapas antingen genom att öppna en mallfil som redan innehåller några ursprungliga tabeller och poster, eller genom att skapa ett nytt dokument.

source: Dialog: New database
sv: Dialogruta: Ny databas

source: Dialog: Create database
sv: Dialogruta: Skapa databas

source: Dialog: Connection
sv: Dialogruta: Anslutning

source: This dialog requests a user name and password for connection to a database server. This is usually not the same username and password combination with which you log in to your system. All Glom systems require a database server on which the actual data will be stored. If the database server is not running on your local computer ("localhost"), then you must also provide its network hostname, such as "glomserver.openismus.com", though your hostname will be different.
sv: Denna dialogruta efterfrågar ett användarnamn och lösenord för anslutning till en databasserver. Detta är vanligen inte samma användarnamn och lösenordskombination som du använder för att logga in till ditt system. Alla Glom-system kräver en databasserver som faktiska data lagras på. Om databasservern inte körs lokalt på din dator (”localhost”) så måste du också använda dess värdnamn på nätverket, så som ”glomserver.openismus.com”, men ditt värdnamn kommer vara något annat än detta.

source: Your system administrator can provide these database login details.
sv: Din systemadministratör kan tillhandahålla dessa databasinloggningsdetaljer.

source: If you are the system administrator, see Glom's <ulink url="http://www.glom.org/wiki/index.php?title=Initial_Postgres_Configuration" type="http">Postgres Configuration</ulink> web page for help with installing and configuring a database server.
sv: Om du är systemadministratören, se Gloms webbsida för <ulink url="http://www.glom.org/wiki/index.php?title=Initial_Postgres_Configuration" type="http">Postgres-konfiguration</ulink> för hjälp med installation och konfiguration av databasservrar.

source: Dialog: Connection Error
sv: Dialogruta: Anslutningsfel

source: This dialog is shown when Glom could not connect to the specified database server. Either the database server is not running at the specified hostname, or the user name and password were not accepted by the database server. See the <link linkend="dialog_connection">Connection Dialog</link> section for more details.
sv: Denna dialogruta visas då Glom inte kunde ansluta till den angivna databasservern. Antingen så körs inte databasservern på det angivna värdnamnet, eller så accepterades inte användarnamnet och lösenordet av databasservern. Se avsnittet för dialogrutan <link linkend="dialog_connection">Anslutning</link> för mer detaljer.

source: Dialog: Database preferences
sv: Dialogruta: Databasinställningar

source: Dialog: Change language
sv: Dialogruta: Ändra språk

source: Window: Textobject
sv: Fönster: Textobjekt
