Repository: Bot-wxt1221/glom
Catalog: po/*.po
Languages: uk

source: The port of the PostgreSQL server, such as 5434.
uk: Порт сервера PostgreSQL, наприклад 5434.

source: The username for the PostgreSQL server.
uk: Ім'я користувача для сервера PostgreSQL.

source: Use MySQL instead of PostgreSQL.
uk: Використайте MySQL замість PostgreSQL.

source: Glom: The output directory does not exist.
uk: Glom: Вихідний каталог не існує.

source: Glom: The output path is not a directory.
uk: Glom: Вихідний шлях не є каталогом.

source: Please enter the database server's password for the user %1:
uk: Введіть пароль сервера баз даних для користувача %1:

source: The path at which to save the created .po file, such as /home/someuser/somefile.po .
uk: Шлях, за яким буде збережено створений .po-файл, наприклад /home/someuser/somefile.po .

source: The locale whose translations should be written to the .po file, such as de_DE.
uk: Локаль, переклади якої мають бути записані в файл .po, наприклад de_DE.

source: Generate a .pot template file instead of a .po file for a locale.
uk: Створити файл .pot-шаблону замість .po-файлу для локалі.

source: Please specify a glom file.
uk: Вкажіть файл glom.

source: Please use either the --locale-id option or the --template option.
uk: Використайте параметр --locale-id або --template.

source: Please specify an output path.
uk: Вкажіть вихідний шлях.

source: Pot file creation failed.
uk: Не вдалося створити .pot-файл.

source: Pot file created at: %1
uk: Pot-файл створений за шляхом: %1

source: Po file creation failed.
uk: Не вдалося створити .po-файл.

source: Po file created at: %1
uk: Po-файл створений за шляхом: %1

source: The directory path at which to save the created .po files, such as /home/someuser/po_files/ .
uk: Шлях до каталогу, в якому будуть збережені створені .po-файли, наприклад /home/someuser/po_files/ .

source: The Glom file does not exist.
uk: Файлу Glom не існує.

source: The Glom file path is a directory instead of a file.
uk: Шлях до файлу Glom є каталогом, а не файлом.

source: The output directory could not be created.
uk: Не вдалося створити вихідний каталог.

source: Glom: The output file path is not a directory.
uk: Glom: Вихідний шлях не є каталогом.

source: The Glom document has no translations.
uk: Документ Glom не має перекладів.

source: The path to a directory containing .po files, such as /home/someuser/po_files/ .
uk: Шлях до каталогу, що містить .po-файли, наприклад /home/someuser/po_files/ .

source: Please specify the path to a directory containing po files.
uk: Вкажіть шлях до каталогу, що містить po-файли.

source: Glom: The po files directory path is not a directory.
uk: Glom: Шлях до каталогу po-файлів не є каталогом.

source: Po file import failed for locale: %1
uk: Не вдалося імпортувати po-файл для локалі: %1

source: Po file import failed during document saving for locale: %1
uk: На вдалося імпортувати po-файл під час зберігання документу для локалі: %1

source: Po file imported for locale: %1 for file %2
uk: Po-файл імпортований для локалі: %1 для файлу %2

source: The hostname of the PostgreSQL server, such as localhost.
uk: Ім'я хосту сервера PostgreSQL, наприклад localhost.

source: The specific database on the PostgreSQL server (Optional).
uk: Конкретна база даних на сервері PostgreSQL (Необов’язково).

source: Please provide a database username.
uk: Введіть ім’я користувача бази даних.

source: Please enter the PostgreSQL server's password for the user %1:
uk: Введіть пароль сервера PostgreSQL для користувача: %1:

source: Error: Could not connect to the server even without specifying a database.
uk: Помилка: Не вдалося підключитися до серверу, навіть без вказування конкретної бази даних.

source: Error: Could not connect to the specified database.
uk: Помилка: Не вдалося підключитися до вказаної бази даних.

source: Successful connection.
uk: Успішне підключення.

source: You seem to be running Glom as a user with administrator privileges. Glom may not be run with such privileges for security reasons. Please login to your system as a normal user.
uk: Здається, ви використовуєте Glom як користувач із правами адміністратора. Glom не використовується з такими привілеями з міркувань безпеки. Увійдіть в систему як звичайний користувач.

source: You seem to be running Glom as root. Glom may not be run as root. Please login to your system as a normal user.
uk: Здається, ви використовуєте Glom як суперкористувач. Glom не можна використовувати в такому режимі. Увійдіть у систему як звичайний користувач.

source: Running As Root
uk: Використовується як суперкористувач

source: Incomplete Glom Installation
uk: Неповне встановлення Glom

source: Your installation of Glom is not complete, because PostgreSQL is not available on your system. PostgreSQL is needed for self-hosting of Glom databases. You may now install PostgreSQL to complete the Glom installation.
uk: Встановлення Glom не завершено, оскільки PostgreSQL недоступний у вашій системі. PostgreSQL необхідний для самохостингу баз даних Glom. Ви можете зараз встановити PostgreSQL, щоб завершити встановлення Glom.

source: Install PostgreSQL
uk: Встановити PostgreSQL

source: Your installation of Glom is not complete, because PostgreSQL is not available on your system. PostgreSQL is needed for self-hosting of Glom databases. Please report this bug to your vendor, or your system administrator so it can be corrected.
uk: Встановлення Glom не завершено, оскільки PostgreSQL недоступний у вашій системі. PostgreSQL необхідний для самохостингу баз даних Glom. Повідомте про цю помилку своєму постачальнику або системному адміністратору, щоб її можна було виправити.

source: Your installation of Glom is not complete, because MySQL is not available on your system. MySQL is needed for self-hosting of some Glom databases. You may now install MySQL to complete the Glom installation.
uk: Встановлення Glom не завершено, оскільки MySQL недоступний у вашій системі. MySQL необхідний для самохостингу деяких баз даних Glom. Ви можете зараз встановити MySQL, щоб завершити встановлення Glom.

source: Install MySQL
uk: Встановити MySQL

source: Your installation of Glom is not complete, because MySQL is not available on your system. MySQL is needed for self-hosting of some Glom databases. Please report this bug to your vendor, or your system administrator so it can be corrected.
uk: Встановлення Glom не завершено, оскільки MySQL недоступний у вашій системі. MySQL необхідний для самохостингу деяких баз даних Glom. Повідомте про цю помилку своєму постачальнику або системному адміністратору, щоб її можна було виправити.

source: Your installation of Glom is not complete, because the Glom Python module is not available on your system. Please report this bug to your vendor, or your system administrator so it can be corrected.
uk: Встановлення Glom не завершено, оскільки модуль Python для Glom недоступний у вашій системі. Повідомте про цю помилку своєму постачальнику або системному адміністратору, щоб її можна було виправити.

source: Glom Python Module Not Installed
uk: Модуль Python для Glom не встановлено

source: Your installation of Glom is not complete, because the gi.repository Python module is not available on your system. Please report this bug to your vendor, or your system administrator so it can be corrected.
uk: Встановлення Glom не завершено, оскільки модуль gi.repository для Python недоступний у вашій системі. Повідомте про цю помилку своєму постачальнику або системному адміністратору, щоб її можна було виправити.

source: gi.repository Python Module Not Installed
uk: Модуль gi.repository для Python не встановлено

source: Your installation of Glom is not complete, because the gi.repository.Gda python module is not available on your system. Please report this bug to your vendor, or your system administrator so it can be corrected.
uk: Встановлення Glom не завершено, оскільки модуль gi.repository.Gda для python недоступний у вашій системі. Повідомте про цю помилку своєму постачальнику або системному адміністратору, щоб її можна було виправити.

source: gi.repository.Gda Python Module Not Installed
uk: Модуль gi.repository.Gda для Python не встановлено

source: Your installation of Glom is not complete, because the PostgreSQL libgda provider is not available on your system. This provider is needed to access Postgres database servers. Please report this bug to your vendor, or your system administrator so it can be corrected.
uk: Встановлення Glom не завершено, оскільки провайдер libgda для PostgreSQL недоступний у вашій системі. Цей провайдер необхідний для доступу до серверів баз даних Postgres. Повідомте про цю помилку своєму постачальнику або системному адміністратору, щоб її можна було виправити.

source: Extra Glom options
uk: Додаткові параметри Glom

source: Extra command-line options for glom
uk: Додаткові параметри командного рядка для glom

source: Show how Glom outputs a date in this locale, then stop.
uk: Показати, як Glom відображає дату в цій локалі, потім зупинити.

source: Main Glom options
uk: Головні параметри Glom

source: Main command-line options for glom
uk: Головні параметри командного рядка для glom

source: The Filename
uk: Назва файлу

source: Whether the filename is a .tar.gz backup to be restored.
uk: Чи назва файлу є резервною копією .tar.gz, яку потрібно відновити.

source: Do not automatically stop the database server if Glom quits. This is helpful for debugging with gdb.
uk: Не зупиняти сервер баз даних автоматично при виході із Glom. Це корисно для налагодження за допомогою gdb.

source: Show the generated SQL queries on stdout, for debugging.
uk: Показувати згенеровані запити SQL на stdout для налагодження.

source: _Edit
uk: _Редагувати

source: _Layout
uk: _Макет

source: This data cannot be stored in the database because you have not provided a primary key. Do you really want to discard this data?
uk: Ці дані не можуть бути збережені в базі даних, оскільки ви не надали первинний ключ. Ви дійсно хочете відхилити ці дані?

source: No primary key value
uk: Немає значення первинного ключа

source: _Add
uk: _Додати

source: _First
uk: _Перший

source: _Back
uk: _Назад

source: _Forward
uk: _Вперед

source: _Last
uk: _Останній

source: Create a new record.
uk: Створити новий запис.

source: Remove this record.
uk: Вилучити цей запис.

source: View the first record in the list.
uk: Переглянути перший запис у списку.

source: View the previous record in the list.
uk: Переглянути попередній запис у списку.

source: View the next record in the list.
uk: Переглянути наступний запис у списку.

source: View the last record in the list.
uk: Переглянути останній запис у списку.

source: Layout Contains No Fields
uk: Макет не містить полів

source: There are no fields on the layout, so there is no way to enter data in a new record.
uk: На макеті немає полів, тому неможливо ввести дані у новий запис.

source: No primary key value.
uk: Немає значення первинного ключа.

source: This record cannot be deleted because there is no primary key.
uk: Цей запис не може бути вилучений, тому що немає первинного ключа.

source: Primary key auto increments
uk: Первинний ключ автоматично збільшується

source: The primary key is auto-incremented. You may not enter your own primary key value.
uk: Первинний ключ автоматично збільшується. Ви не можете ввести власне значення первинного ключа.

source: No Corresponding Record Exists
uk: Не існує відповідного запису

source: No record with this value exists. Therefore navigation to the related record is not possible.
uk: Жодного запису з цим значенням не існує. Тому перехід до пов'язаного запису неможливий.

source: New Group
uk: Нова група

source: notebook
uk: блокнот

source: tab1
uk: вкладка1

source: Tab One
uk: Вкладка один

source: button
uk: кнопка

source: New Button
uk: Нова кнопка

source: text
uk: текст

source: New Text
uk: Новий текст

source: Delete whole group "%1"?
uk: Вилучити цілу групу "%1"?

source: Delete whole group?
uk: Вилучити цілу групу?

source: List Or Details View
uk: Список або детальний перегляд

source: This relationship already exists. Please choose a different relationship name
uk: Цей зв'язок вже існує. Оберіть іншу назву зв'язка.

source: From Field
uk: З поля

source: To Field
uk: В поле

source: Allow Editing
uk: Дозволити редагування

source: Automatic Creation
uk: Автоматичне створення

source: Title (Singular Form)
uk: Заголовок (форма однини)

source: Next Value
uk: Наступне значення

source: None selected
uk: Жодного не вибрано

source: Username Is Empty
uk: Ім'я користувача порожнє

source: Please enter a login name for the new user.
uk: Введіть ім’я для входу нового користувача.

source: Passwords Do Not Match
uk: Паролі не збігаються

source: The entered password does not match the entered password confirmation. Please try again.
uk: Введений пароль не збігається з підтвердженням пароля. Спробуйте ще раз.

source: Password Is Empty
uk: Пароль порожній

source: Please enter a password for this user.
uk: Введіть пароль для цього користувача.

source: This field already exists. Please choose a different field name.
uk: Це поле вже існує. Оберіть іншу назву поля.

source: Type
uk: Тип

source: _Field Definition
uk: Визначення _поля

source: _Default Formatting
uk: _Типове форматування

source: Recalculation Required
uk: Потрібен перерахунок

source: You have changed the calculation used by this field so Glom must recalculate the value in all records. If the table contains many records then this could take a long time.
uk: Ви змінили обчислення, що використовуються цим полем, тому Glom повинен перерахувати значення у всіх записах. Якщо таблиця містить багато записів, це може зайняти багато часу.

source: Recalculate
uk: Перерахувати

source: Invalid database structure
uk: Недійсна структура бази даних

source: This database field was created or edited outside of Glom. It has a data type that is not supported by Glom. Your system administrator may be able to correct this.
uk: Це поле бази даних було створено або відредаговано поза межами Glom. Воно має тип даних, який не підтримується Glom. Ваш системний адміністратор може це виправити.

source: Primary key required
uk: Потрібен первинний ключ

source: You may not unset the primary key because the table must have a primary key. You may set another field as the primary key instead.
uk: Ви не можете скасувати первинний ключ, оскільки він обов'язковий для таблиці. Натомість ви можете встановити інше поле як первинний ключ.

source: Field contains empty values.
uk: Поле містить порожні значення.

source: The field may not yet be used as a primary key because it contains empty values.
uk: Поле ще не може використовуватися як первинний ключ, оскільки воно містить порожні значення.

source: Field contains non-unique values.
uk: Поле містить не унікальні значення.

source: The field may not yet be used as a primary key because it contains values that are not unique.
uk: Поле ще не може використовуватися як первинний ключ, оскільки воно містить значення, які не є унікальними.

source: Change primary key
uk: Змінити первинний ключ

source: Are you sure that you wish to set this field as the primary key, instead of the existing primary key?
uk: Ви впевнені, що хочете встановити це поле як первинний ключ, замість поточного?

source: Change Primary Key
uk: Змінити первинний ключ

source: Field Name Already Exists
uk: Назва поля вже існує

source: This field already exists. Please choose a different field name
uk: Це поле вже існує. Виберіть іншу назву поля

source: Calculation Error
uk: Помилка обчислень

source: The calculation does not have a return statement.
uk: Обчислення не повертає значення.

source: Calculation result
uk: Результат обчислення

source: The result of the calculation is: %1
uk: Результат обчислення: %1

source: Calculation failed
uk: Помилка обчислення

source: The calculation failed with this error: %s
uk: Помилка обчислення: %s

source: Default Value
uk: Типове значення

source: (None)
uk: (Немає)

source: Via: %1::%2
uk: Через: %1::%2

source: Via: %1
uk: Через: %1

source: None: No visible tables are specified by the fields.
uk: Немає: Поля не вказують видимих ​​таблиць.

source: Group Columns
uk: Стовпців групи

source: Display Width
uk: Ширина дисплея

source: Text Title
uk: Заголовок тексту

source: Image Title
uk: Заголовок зображення

source: group
uk: група

source: Notebook Tabs
uk: Вкладки блокнота

source: Add child groups to the notebook to add tabs.
uk: Додайте дочірні групи до блокнота, щоб додати вкладки.

source: Related Calendar: %1
uk: Пов'язаний календар: %1

source: Related List: %1
uk: Пов'язаний список: %1

source: Field: %1
uk: Поле: %1

source: (Notebook)
uk: (Блокнот)

source: Fields
uk: Поля

source: Invalid Relationship
uk: Недійсний зв'язок

source: The relationship may not be used to show related records because the relationship does not specify a field in the related table.
uk: Зв'язок не може показати пов'язані записи, оскільки у зв'язку не вказано поле у пов'язаній таблиці.

source: Relationship Uses a Related Primary Key
uk: Зв'язок використовує пов'язаний первинний ключ

source: The relationship may not be used to show related records because the relationship uses a primary key field in the related table, which must contain unique values. This would prevent the relationship from specifying multiple related records.
uk: Зв’язок не може показати пов’язані записи, оскільки у пов’язаній таблиці використовується поле первинного ключа, що має містити унікальні значення. Це не дозволить вказати декілька пов'язаних записів.

source: Relationship Uses a Related Unique Field
uk: Зв'язок використовує пов'язане унікальне поле

source: The relationship may not be used to show related records because the relationship uses a unique-values field in the related table. This would prevent the relationship from specifying multiple related records.
uk: Зв'язок не може показати пов'язані записи, оскільки він у пов'язаній таблиці використовується поле унікальних значень. Це не дозволить вказати декілька пов'язаних записів.

source: Automatic
uk: Автоматичне

source: Left
uk: Ліве

source: Right
uk: Праве

source: Extra Fields
uk: Додаткові поля

source: Sort Order
uk: Порядок сортування

source: Font
uk: Шрифт

source: Foreground Color
uk: Колір переднього плану

source: Background Color
uk: Колір фону

source: The calculation failed with this error: %1
uk: Помилка обчислення: %1

source: Formatting
uk: Форматування

source: Group By - Secondary Fields
uk: Групування за - вторинними полями

source: Ascending
uk: В порядку зростання

source: Part
uk: Частина

source: This item already exists. Please choose a different item name
uk: Цей елемент уже існує. Виберіть іншу назву елементу

source: Are you sure that you want to rename this print layout?
uk: Ви впевнені, що хочете перейменувати цей макет друку?

source: <b>Rename Print Layout</b>
uk: <b>Перейменувати макет друку</b>

source: Rename
uk: Перейменувати

source: Items
uk: Елементи

source: Lines
uk: Лінії

source: Records
uk: Записи

source: Database Field
uk: Поле бази даних

source: Drag this to the layout to add a new database field.
uk: Перетягніть це до макета, щоб додати нове поле бази даних.

source: Drag this to the layout to add a new static text box.
uk: Перетягніть це до макета, щоб додати нове статичне текстове поле.

source: Drag this to the layout to add a new static image.
uk: Перетягніть це до макета, щоб додати нове статичне зображення.

source: Horizontal Line
uk: Горизонтальна лінія

source: Drag this to the layout to add a new horizontal line.
uk: Перетягніть це до макета, щоб додати нову горизонтальну лінію.

source: Vertical Line
uk: Вертикальна лінія

source: Drag this to the layout to add a new vertical line.
uk: Перетягніть це до макета, щоб додати нову вертикальну лінію.

source: Related Records
uk: Пов'язані записи

source: Drag this to the layout to add a new related records portal.
uk: Перетягніть це до макета, щоб додати новий портал пов'язаних записів.

source: Create Standard Layout
uk: Створити стандартний макет

source: This is an experimental feature. It will remove all items from the print layout and then try to create a layout similar to the layout of the detail view.
uk: Це експериментальна функція. Вона вилучить усі елементи з макета друку і спробує створити макет, схожий на макет подання деталей.

source: Create
uk: Створити

source: Remove page
uk: Вилучити сторінку

source: Are you sure that you wish to remove the last page and any items on that page?
uk: Ви впевнені, що хочете вилучити останню сторінку та всі елементи на цій сторінці?

source: Remove Page
uk: Вилучити сторінку

source: Remove library script
uk: Вилучити сценарій бібліотеки

source: Do you really want to delete this script? This data can not be recovered
uk: Ви дійсно хочете вилучити цей сценарій? Дані неможливо буде відновити

source: _Remove
uk: _Вилучити

source: View
uk: Переглянути

source: Delete Group
uk: Вилучити групу

source: Are your sure that you wish to delete this group?
uk: Ви впевнені, що хочете вилучити цю групу?

source: Full access.
uk: Повний доступ.

# Users List
source: User
uk: Користувач

source: Delete User
uk: Вилучити користувача

source: Are your sure that you wish to delete this user?
uk: Ви впевнені, що хочете вилучити цього користувача?

source: Error Retrieving the List of Users
uk: Помилка отримання списку користувачів

source: Glom could not get the list of users from the database server. You probably do not have enough permissions. You should be a superuser.
uk: Glom не вдалося отримати список користувачів із сервера баз даних. Можливо, ви не маєте достатніх прав. Ви маєте бути суперкористувачем.

source: Developer group may not be empty.
uk: Група розробників не може бути порожньою.

source: The developer group must contain at least one user.
uk: Група розробників повинна містити принаймні одного користувача.

source: This table already exists. Please choose a different table name
uk: Ця таблиця вже існує. Виберіть іншу назву таблиці.

source: Hidden
uk: Прихований

source: Default
uk: Типовий

source: Table Names Cannot Contain Spaces
uk: Назви таблиць не можуть містити пробіли

source: Unfortunately, Glom tables cannot have names that contain spaces. Please enter a different name for the table.
uk: На жаль, назви таблиць в Glom не можуть містити пробіли. Введіть іншу назву для таблиці.

source: Table Already Exists
uk: Таблиця вже існує

source: This table already exists on the database server, though it is not mentioned in the .glom file. This should not happen. Would you like Glom to attempt to use the existing table?
uk: Таблиця вже існує на сервері бази даних, хоча вона і не згадується в .glom-файлі. Цього не повинно було статися. Чи хотіли б ви, щоб Glom спробував використати наявну таблицю?

source: You cannot delete this table, because there is no information about this table in the document.
uk: Ви не можете вилучити цю таблицю, оскільки в документі немає інформації про неї.

source: Are you sure that you want to delete this table? Table name: %1
uk: Ви впевнені, що хочете вилучити цю таблицю? Назва таблиці: %1

source: Delete Table
uk: Вилучити таблицю

source: Are you sure that you want to rename this table?
uk: Ви впевнені, що хочете перейменувати цю таблицю?

source: <b>Rename Table</b>
uk: <b>Перейменувати таблицю</b>

source: Unknown Table
uk: Невідома таблиця

source: You cannot open this table, because there is no information about this table in the document.
uk: Ви не можете відкрити цю таблицю, оскільки в документі немає інформації про неї.

source: Choose Field
uk: Виберіть поле

source: _Formatting
uk: _Форматування

source: Original
uk: Оригінал

source: Translation
uk: Переклад

source: Item
uk: Елемент

source: Choose .po File Name
uk: Оберіть ім'я .po-файлу

source: Po files
uk: Po-файли

source: Export
uk: Експорт

source: Import
uk: Імпорт
