Repository: Bot-wxt1221/glom
Catalog: po/*.po
Languages: uk

source: This item already exists. Please try again.
uk: Цей елемент уже існує. Спробуйте ще раз.

source: Duplicate
uk: Дублікат

source: Example
uk: Приклад

source: Choose a date from an on-screen calendar.
uk: Оберіть дату з екранного календаря.

source: Open the record identified by this ID, in the other table.
uk: Відкрити запис з таким ідентифікатором в іншій таблиці.

source: Enter search criteria to identify records in the other table, to choose an ID for this field.
uk: Введіть критерії пошуку, щоб ідентифікувати записи в іншій таблиці та вибрати ідентифікатор для цього поля.

source: _New
uk: _Новий

source: Enter details for a new record in the other table, then use its ID for this field.
uk: Введіть деталі для нового запису в іншій таблиці, потім використайте його ідентифікатор для цього поля.

source: Table Content
uk: Зміст таблиці

source: ExampleEg
uk: ПрикладНапр

source: Right-click to layout, to specify the related fields.
uk: Клацніть правою кнопкою миші на макет, щоб вказати пов'язані поля.

source: Extra Related Records Not Possible
uk: Додаткові пов'язані записи неможливі

source: You attempted to add a new related record, but there can only be one related record, because the relationship uses a unique key.
uk: Ви намагалися додати новий пов’язаний запис, але пов’язаний запис може бути лише один, оскільки у зв’язку використовується унікальний ключ.

source: Select
uk: Обрати

source: You have not entered any quick find criteria.
uk: Ви не ввели жодного критерію швидкого пошуку.

source: Not enough memory available to load the image
uk: Недостатньо пам'яті для завантаження зображення

source: Error loading %1
uk: Помилка завантаження %1

source: Error loading image
uk: Помилка завантаження зображення

source: Error Saving
uk: Помилка зберігання

source: Error saving image
uk: Помилка зберігання зображення

source: New Database
uk: Нова база даних

source: Please choose a human-readable title for the new database. You can change this later in the database properties. It may contain any characters.
uk: Виберіть читабельний заголовок для нової бази даних. Ви зможете змінити його пізніше у властивостях бази даних. Заголовок може містити будь-які символи.

source: _Title:
uk: _Заголовок:

source: Create PostgreSQL database in its own folder, to be hosted by this computer.
uk: Створити базу даних PostgreSQL у власній теці для розміщення на цьому комп'ютері.

source: Create database on an external PostgreSQL database server, to be specified in the next step.
uk: Створити базу даних на зовнішньому сервері баз даних PostgreSQL, який буде вказано на наступному кроці.

source: Create database in its own folder, to be hosted by this computer.
uk: Створити базу даних у власній папці для розміщення на цьому комп'ютері.

source: Create database on an external database server, to be specified in the next step.
uk: Створити базу даних на зовнішньому сервері баз даних, який буде вказано на наступному кроці.

source: Create SQLite database in its own folder, to be hosted by this computer.
uk: Створити базу даних SQLite у власній папці для розміщення на цьому комп'ютері.

source: SQLite does not support authentication or remote access but is suitable for embedded devices.
uk: SQLite не підтримує автентифікацію або віддалений доступ, але підходить для вбудованих пристроїв.

source: Create MySQL database in its own folder, to be hosted by this computer.
uk: Створити базу даних MySQL у власній папці для розміщення на цьому комп'ютері.

source: MySQL support in Glom is experimental and unlikely to work properly.
uk: Підтримка MySQL в Glom експериментальна і навряд чи буде працювати належним чином.

source: Create database on an external MySQL database server, to be specified in the next step.
uk: Створити базу даних на зовнішньому сервері баз даних MySQL, який буде вказаний на наступному кроці.

source: Images
uk: Зображення

source: Save Image
uk: Зберегти зображення

source: Choose Image
uk: Оберіть зображення

source: _Open File
uk: _Відкрити файл

source: Open File With
uk: Відкрити файл за допомогою

source: _Copy
uk: _Копіювати

source: _Paste
uk: _Вставити

source: _Clear
uk: _Очистити

source: Containers
uk: Контейнери

source: Drag this to the layout to add a new group.
uk: Перетягніть це до макета, щоб додати нову групу.

source: Drag this to the layout to add a new notebook.
uk: Перетягніть це до макета, щоб додати новий блокнот.

source: Drag this to the layout to add a new Related Record.
uk: Перетягніть це до макета, щоб додати новий пов'язаний запис.

source: Drag this to the layout to add a new button.
uk: Перетягніть це до макета, щоб додати нову кнопку.

source: Field Layout Properties
uk: Властивості макета поля

source: Add Related Records
uk: Додати пов'язані записи

source: Add Notebook
uk: Додати блокнот

source: Add Group
uk: Додати групу

source: Add Button
uk: Додати кнопку

source: Add Text
uk: Додати текст

source: Delete
uk: Вилучити

source: Properties
uk: Властивості

source: Delete whole notebook "%1"?
uk: Вилучити цілий блокнот "%1"?

source: Delete whole notebook?
uk: Вилучити цілий блокнот?

source: _Show hidden tables
uk: _Показати приховані таблиці

source: _Close
uk: _Закрити

source: Choose Date
uk: Оберіть дату

source: _Help
uk: _Довідка

source: _OK
uk: _Гаразд

source: <span weight="bold" size="larger">Choose Date</span> Please select a date to enter in this field.
uk: <span weight="bold" size="larger">Оберіть дату</span> Виберіть дату, яку потрібно ввести у цьому полі.

source: Connect to Server
uk: Підключитися до сервера

source: C_onnect
uk: П_ідключитися

source: Please enter the connection details for your database server.
uk: Введіть деталі з'єднання для вашого сервера баз даних.

source: Host
uk: Хост

source: User
uk: Користувач

source: _Host:
uk: _Хост:

source: Database:
uk: База даних:

source: _User:
uk: _Користувач:

source: _Password:
uk: _Пароль:

source: Database
uk: База даних

source: _Revert
uk: _Повернути

source: <span weight="bold" size="larger">Invalid Format</span> The data in the field was not recognized. Please try to correct the data or revert to the previous value. Here is an example of correctly-formatted data for this field.
uk: <span weight="bold" size="larger">Невідомий формат</span> Дані в полі не розпізнано. Спробуйте виправити дані або повернутися до попереднього значення. Ось приклад правильно відформатованих даних для цього поля.

source: example data format
uk: приклад формату дати

source: Welcome to Glom
uk: Ласкаво просимо до Glom

source: _Quit
uk: _Вийти

source: _Select
uk: _Обрати

source: <span weight="bold" size="larger">Open or Create a Document</span>
uk: <span weight="bold" size="larger">Відкрити або створити документ</span>

source: Open or create Document
uk: Відкрити або створити документ

source: Open Existing Document
uk: Відкрити наявний документ

source: Create New Document
uk: Створити новий документ

source: Find Related Record
uk: Знайти пов'язаний запис

source: <b>Table:</b>
uk: <b>Таблиця:</b>

source: table_name
uk: назва_таблиці

source: New Related Record
uk: Новий пов'язаний запис

source: Loading image
uk: Завантаження зображення

source: Saving Image
uk: Збереження зображення

source: bla.blub - Import from CSV
uk: bla.blub - імпорт із CSV

source: I_mport
uk: І_мпортувати

source: label
uk: позначка

source: _First line as title
uk: _Перший рядок як заголовок

source: _Encoding:
uk: _Кодування:

source: Import Into _Table:
uk: Імпортувати в _таблицю:

source: Encoding detected as: UTF-8
uk: Кодування виявлено як: UTF-8

source: <b>Import Options</b>
uk: <b>Параметри імпорту</b>

source: _Number of sample rows:
uk: _Кількість зразків рядків:

source: <b>Import Fields</b>
uk: <b>Імпорт полів</b>

source: Importing Data
uk: Імпортування даних

source: Please wait while your data is imported.
uk: Зачекайте, поки ваші дані імпортуються.

source: _File
uk: _Файл

source: _Save as Example
uk: _Зберегти як приклад

source: S_hared on Network
uk: С_пільний доступ по мережі

source: _Print
uk: _Друкувати

source: _Edit Print Layouts
uk: _Редагувати макети друку

source: Cu_t
uk: Ви_різати

source: _Tables
uk: _Таблиці

source: _Edit Tables
uk: _Редагувати таблиці

source: R_eports
uk: З_віти

source: _Edit Reports
uk: _Редагувати звіти

source: _Developer
uk: _Розробник

source: _Operator
uk: _Оператор

source: _Fields
uk: _Поля

source: _Relationships
uk: _Зв'язки

source: Relationships _Overview
uk: _Огляд зв'язків

source: _Print Layouts
uk: Макети _друку

source: _Reports
uk: _Звіти

source: _Database Preferences
uk: Налаштування _бази даних

source: _Users
uk: _Користувачі

source: Script _Library
uk: _Бібліотека сценаріїв

source: _Translations
uk: _Переклади

source: Test Tra_nslation
uk: Перевірити пе_реклад

source: Active Platform
uk: Активна платформа

source: _Normal
uk: _Звичайна

source: _Maemo
uk: _Платформа Maemo

source: _Drag and Drop Layout
uk: _Макет Drag-and-drop

source: _Export Backup
uk: _Експортувати резервну копію

source: _Restore Backup
uk: _Відновити резервну копію

source: _About
uk: _Про програму

source: _Contents
uk: _Зміст

source: Add Related Table
uk: Створити пов'язану таблицю

source: C_reate Table
uk: С_творити таблицю

source: This will add a new table and add a relationship that refers to the new table, as a convenient alternative to doing this in separate steps. If a suitable related table already exists then you should instead cancel and just add a relationship.
uk: Це додасть нову таблицю та зв'язок до неї, як зручну альтернативу для цієї операції в окремих кроках. Якщо відповідна пов'язана таблиця вже існує, тоді вам слід відмінити цю дію та просто додати зв'язок.

source: From field:
uk: "FROM"-поле:

source: _Edit Fields
uk: _Редагувати поля

source: Name of new related table:
uk: Назва нової пов'язаної таблиці:

source: Name of new relationship:
uk: Назва нового зв'язку:

source: Test Translation
uk: Перевірити переклад

source: Change Language
uk: Змінити мову

source: <span weight="bold" size="larger">Test Translation</span> Choose a language to use temporarily to test the translations. These translations are normally used automatically when the application is started on a computer that uses the language. Note that the standard parts of the Glom user interface, such as menus and dialog windows, will only be translated when you start Glom on a computer that uses that language.
uk: <span weight="bold" size="larger">Перевірити переклад</span> Виберіть мову для тимчасового тестування перекладів. Зазвичай ці переклади використовуються автоматично при запуску програми на комп’ютері, який використовує цю мову. Зверніть увагу, що стандартні частини інтерфейсу користувача Glom, такі як меню та діалогові вікна, будуть перекладені лише тоді, коли ви запустите Glom на комп'ютері, який використовує цю мову.

source: Locale:
uk: Локаль:

source: Select Field
uk: Оберіть поле

source: Show _Related Relationships
uk: Показати _пов'язані зв'язки

source: _Table:
uk: _Таблиця:

source: Select Relationship
uk: Виберіть зв'язок

source: Table:
uk: Таблиця:

source: Choose User
uk: Виберіть користувача

source: <span weight="bold" size="larger">Add User To Group</span> Which user should be added to this group?
uk: <span weight="bold" size="larger">Додати користувача до групи</span> Якого користувача слід додати до цієї групи?

source: Database Preferences
uk: Налаштування бази даних

source: System Name:
uk: Назва системи:

source: Name:
uk: Ім'я:

source: Country:
uk: Країна:

source: Zip/Postal Code:
uk: Zip/Postal-код:

source: State/County:
uk: Штат/Графство:

source: Town:
uk: Місто:

source: Street (Line 2):
uk: Вулиця (рядок 2)

source: Street:
uk: Вулиця:

source: <b>Address</b>
uk: <b>Адреса</b>

source: Organisation
uk: Організація

source: Logo
uk: Логотип

source: Auto-increment values
uk: Автоматичне збільшення значень

source: When the database is opened the python function implemented here will run.
uk: При відкритті бази даних буде виконана реалізована тут функція python.

source: Test
uk: Тест

source: Startup Script
uk: Сценарій запуску

source: Table:
uk: Таблиця:

source: _Up
uk: _Вгору

source: _Down
uk: _Вниз

source: <b>Fields</b>
uk: <b>Поля</b>

source: Field:
uk: Поле:

source: Summary Type:
uk: Тип підсумку:

source: Group Properties
uk: Властивості групи

source: Columns:
uk: Стовпці:

source: Title:
uk: Заголовок:

source: Sort Fields:
uk: Сортувати поля:

source: Secondary Fields:
uk: Вторинні поля:

source: Border Width (ems):
uk: Ширина границі (у одиницях em):

source: Database User
uk: Користувач бази даних

source: C_reate
uk: С_творити

source: Please enter the initial connection details for your database. You may add additional users later. Remember to keep this password secret because it allows access to your data from other computers on the network.
uk: Введіть початкові дані про підключення для вашої бази даних. Ви зможете додати додаткових користувачів пізніше. Не забувайте зберігати цей пароль у таємниці, оскільки він надає доступ до ваших даних з інших комп’ютерів у мережі.

source: _Confirm Password:
uk: _Підтвердити пароль:

source: Text Object
uk: Текстовий об'єкт

source: Line Width:
uk: Ширина лінії:

source: Color:
uk: Колір:

source: Field Layout
uk: Макет поля

source: <b>Field:</b>
uk: <b>Поле:</b>

source: Use default field title:
uk: Використати типовий заголовок поля:

source: Use custom title:
uk: Використати власний заголовок:

source: <b>Title</b>
uk: <b>Заголовок</b>

source: Use default formatting
uk: Використати типове форматування

source: Use custom formatting
uk: Використати власне форматування

source: <b>Formatting</b>
uk: <b>Форматування</b>

source: Create Group
uk: Створити групу

source: <span weight="bold" size="larger">Create Group</span> What name should this group have?
uk: <span weight="bold" size="larger">Створити групу</span> Як слід назвати цю групу?

source: Group name:
uk: Назва групи:

source: <span weight="bold" size="larger">Add Module</span> What name should this module have?
uk: <span weight="bold" size="larger">Створити модуль</span> Як слід назвати цей модуль?

source: Script name:
uk: Назва сценарію:

source: <b>Notebook Tabs</b>
uk: <b>Вкладки блокнота</b>

source: Script Library
uk: Бібліотека сценаріїв

source: These modules will be available to your button scripts and field calculations via the python import keyword.
uk: Ці модулі будуть доступні для ваших сценаріїв кнопок та обчислень полів за допомогою ключового слова python import.

source: Module name:
uk: Назва модуля:

source: _Check
uk: _Перевірити

source: Group By - Sort Fields
uk: Групування за - сортуванням полів

source: <b>Sort Fields</b>
uk: <b>Сортувати поля</b>

source: Identify Original
uk: Визначити оригінал

source: Copy Translation
uk: Копіювати переклад

source: <span weight="bold" size="larger">Copy Translation</span> From what language would you like to copy the translations to use as the start of the current translation?
uk: <span weight="bold" size="larger">Копіювати переклад</span> З якої мови ви хочете скопіювати переклади, щоб використати їх як початок поточного перекладу?

source: Language:
uk: Мова:

source: <span weight="bold" size="larger">Identify Original</span> The language of the original text is currently identified as:
uk: <span weight="bold" size="larger">Визначити оригінал</span> На даний момент мова оригінального тексту визначена як:

source: <b>English</b>
uk: <b>Англійська</b>

source: If the text is not actually in this language, please choose the correct language.
uk: Якщо текст не належить до цієї мови, виберіть правильну.

source: Group:
uk: Група:

source: Password:
uk: Пароль:

source: Confirm Password:
uk: Підтвердьте пароль:

source: User:
uk: Користувач:

source: Button Script
uk: Сценарій кнопки

source: <b>Title:</b>
uk: <b>Заголовок:</b>

source: When the button is clicked it will run the python function which you implement here.
uk: Після натискання кнопки запускається функція python, яку ви тут реалізуєте.

source: Export Format
uk: Експортувати формат

source: Layout
uk: Макет

source: table name
uk: назва таблиці

source: <b>Relationship:</b>
uk: <b>Зв'язок:</b>

source: Show child relationships
uk: Показати дочірні зв'язки

source: Add Field
uk: Додати поле

source: Add a layout item that shows the data from a field in the record, and allows the user to edit that value.
uk: Додати елемент макета, який відображає дані із поля в записі, і дозволяє користувачеві редагувати це значення.

source: Add text to a layout, such as an explanation or a warning. The text will be the same for every record viewed.
uk: Додати текст до макета, наприклад, пояснення чи попередження. Текст буде однаковим для кожного переглянутого запису.

source: Add Image
uk: Додати зображення

source: Add an image to the layout, such as a logo. The image will be the same for every record viewed. To show an image field from a record, to show different images for each field, use the field layout item.
uk: Додати до макета зображення, наприклад логотип. Зображення буде однаковим для кожного переглянутого запису. Щоб показувати поле зображення з певного запису, відображати різні зображення для кожного поля, використовуйте елемент макета поля.

source: Add a button. Edit the button to define the script that will be run when the button is clicked.
uk: Додати кнопку. Відредагуйте кнопку, щоб визначити сценарій, який запускатиметься при натискання кнопки.

source: Add a group which can contain other layout items. Use this to group items together, such as fields.
uk: Додати групу, яка може містити інші елементи макета. Використовуйте цей елемент, щоб групувати елементи, такі як поля, разом.

source: Add a tabbed notebook. Each page of the notebook may contain several other layout items, but only one page will be visible at one time.
uk: Додати блокнот із вкладками. Кожна сторінка блокнота може містити кілька інших елементів макета, але одночасно буде видно лише одну сторінку.

source: Add a related records portal. This is a list of records in a related table. Remember to edit this layout item to specify the relationship to use, and the fields to show from the related table.
uk: Додати відповідний портал записів. Це список записів у пов'язаній таблиці. Не забудьте відредагувати цей елемент макета, щоб вказати взаємозв'язок, який слід використовувати, та поля, які потрібно показати з відповідної таблиці.

source: Add Related Calendar
uk: Додати пов'язаний календар

source: Add a related records calendar portal. This is a calendar showing records from a related table. Remember to edit this layout item to specify the relationship to use, and the fields to show from the related table.
uk: Додати відповідний портал календаря записів. Це календар, що відображає записи із відповідної таблиці. Не забудьте відредагувати цей елемент макета, щоб вказати взаємозв'язок, який слід використовувати, та поля, які потрібно показати з відповідної таблиці.

source: Remove the item from the layout. If you remove a field layout item, it will not remove the field from the table itself. It just will not be seen on the layout.
uk: Вилучити елемент із макета. Якщо ви вилучите елемент макета поля, це не вилучить поле з самої таблиці. Його просто не буде видно на макеті.

source: Clicking the row button takes the user to the table specified by this relationship:
uk: Натискання кнопки рядка переводить користувача до таблиці, зазначеної цим відношенням:

source: Automatic:
uk: Автоматично:

source: None
uk: Немає

source: <b>Navigation</b>
uk: <b>Навігація</b>

source: Date Field:
uk: Поле дати:

source: <b>Dates</b>
uk: <b>Дати</b>

source: Minimum number of rows:
uk: Мінімальна кількість рядків:

source: Show at least this many rows.
uk: Показувати принаймні стільки рядків.

source: Maximum number of rows:
uk: Максимальна кількість рядків:

source: Show no more than this many rows.
uk: Показувати не більше цієї кількості рядків.

source: Row Line Width:
uk: Ширина лінії рядка:

source: Column Line Width:
uk: Ширина лінії стовпця:

source: Line Color:
uk: Колір лінії:

source: <b>Lines</b>
uk: <b>Лінії</b>

source: Default Formatting
uk: Типове форматування

source: Field Definitions
uk: Визначення полів

source: Field Calculation
uk: Обчислення поля

source: The field value will be the return value of the python function, which you implement here.
uk: Значення поля буде дорівнювати значенню, що повертає функція python, яку ви тут реалізуєте.

source: Triggered by:
uk: Активація через:

source: Field Definition
uk: Визначення поля

source: Typ_e:
uk: Ти_п:

source: _Name:
uk: _Ім'я:

source: _Primary Key
uk: _Первинний ключ

source: _Unique
uk: _Унікальний

source: _Auto-increment
uk: З _автоматичним збільшенням

source: _Lookup value when a field changes.
uk: Значення _пошуку під час зміни поля.

source: _Relationship:
uk: _Зв'язок:

source: _Field:
uk: _Поле:

source: _User Entry
uk: Запис _користувача

source: _Calculate Value
uk: _Обчислити значення

source: Value
uk: Значення

source: Use 1000s separator
uk: Використовувати розділювач тисяч

source: If this is not selected then a thousands separator will not be used, even if your locale would normally use one. If it is selected then a thousands separator will be used only if your locale normally uses one.
uk: Якщо цей параметр не вибрано, то розділювач тисяч не буде використано, навіть якщо він зазвичай використовується у вашій локалі. Якщо цей параметр вибрано, то розділювач буде використано лише в тому випадку, якщо він використовується у вашій локалі.

source: Decimal Places:
uk: Десяткові місця:

source: Currency Symbol:
uk: Символ валюти:

source: Alternative Color for Negative Values
uk: Альтернативний колір для від'ємних значень

source: Click this check box to use a different foreground color to display negative values.
uk: Поставте цей прапорець, щоб використовувати інший колір переднього плану для відображення від'ємних значень.

source: Numeric Formatting
uk: Числове форматування

source: Horizontal Alignment:
uk: Горизонтальне вирівнювання:

source: Multi-line
uk: Багаторядковий

source: If this is selected then the field value will be shown in a multi-line box with a scrollbar.
uk: Якщо цей параметр вибрано, значення поля відображатиметься у багаторядковому полі зі смугою прокрутки.

source: Height (lines)
uk: Висота (у рядках)

source: Font:
uk: Шрифт:

source: Click this check box to use a non-standard font.
uk: Поставте цей прапорець, щоб використати нестандартний шрифт.

source: Foreground Color:
uk: Колір переднього плану:

source: Click this check box to use a non-standard foreground color.
uk: Поставте цей прапорець, щоб використати інший колір переднього плану.

source: Background Color:
uk: Колір фону:

source: Click this check box to use a non-standard background color.
uk: Поставте цей прапорець, щоб використати інший колір фону.

source: Text Formatting
uk: Форматування тексту

source: No Choices
uk: Немає вибору

source: Relationship:
uk: Зв'язок:

source: Also show:
uk: Також показати:

source: Edit
uk: Редагувати

source: Sort Order:
uk: Порядок сортування:

source: Show all records
uk: Показати всі записи

source: If this option is selected then the choices will list values from all records in the related table. If this option is not selected then the choices will list values only from related records.
uk: Якщо вибрано цей параметр, тоді у списку вибору буде вказано значення усіх записів відповідної таблиці. Якщо цей параметр не вибрано, тоді у списку будуть вказані значення лише пов'язаних записів.

source: Choices From Related Records
uk: Вибір із пов’язаних записів

source: Custom Choice List
uk: Власний список вибору

source: Restrict data to these choices
uk: Обмежити дані цим вибором

source: Display as radio buttons
uk: Відображати як перемикачі

source: Choices
uk: Вибір

source: Groups
uk: Групи

source: Users
uk: Користувачі
