Repository: Bot-wxt1221/glom
Catalog: po/*.po
Languages: uk

source: Error while parsing command-line options:
uk: Помилка синтаксичного розбору параметрів командного рядка:

source: Use --help to see a list of available command-line options.
uk: Використайте --help, щоб побачити список доступних параметрів командного рядка.

source: Glom: The file does not exist.
uk: Glom: Файлу не існує.

source: Glom: The file path is a directory instead of a file.
uk: Glom: Шлях веде до каталогу, а не до файлу.

source: Glom: Generating Encryption Certificates
uk: Glom: Створення сертифікатів шифрування

source: Please wait while Glom prepares your system for publishing over the network.
uk: Зачекайте, поки Glom підготує вашу систему до публікації в мережі.

source: A Database GUI
uk: Графічний інтерфейс баз даних

source: Open Failed
uk: Не вдалося відкрити

source: The document could not be found.
uk: Документ не знайдено.

source: The document could not be opened because it was created or modified by a newer version of Glom.
uk: Документ не може бути відкритий, тому що він був створений або змінений за допомогою новішої версії Glom.

source: Connection Failed
uk: Помилка з'єднання

source: Glom could not connect to the database server. Maybe you entered an incorrect user name or password, or maybe the postgres database server is not running.
uk: Glom не може підключитись до серверу бази даних. Можливо, ви ввели неправильне ім'я користувача або пароль, або сервер postgres бази даних не працює.

source: The file cannot be opened because this version of Glom does not support self-hosting of databases.
uk: Файл не може бути відкритий, оскільки ця версія Glom не підтримує бази даних із самохостингом.

source: The file cannot be opened because this version of Glom does not support PostgreSQL databases.
uk: Файл не може бути відкритий, оскільки ця версія Glom не підтримує бази даних PostgreSQL.

source: The file cannot be opened because this version of Glom does not support SQLite databases.
uk: Файл не може бути відкритий, оскільки ця версія Glom не підтримує бази даних SQLite.

source: File Uses Unsupported Database Backend
uk: Файл використовує непідтримуваний протокол бази даних

source: Creating From Example File
uk: Створення з файлу прикладу

source: To use this example file you must save an editable copy of the file. A new database will also be created on the server.
uk: Щоб використати цей файл прикладу, ви маєте зберегти відкриту для редагування копію файлу. Нова база даних також буде створена на сервері.

source: Creating From Backup File
uk: Створення з файлу резервної копії

source: To use this backup file you must save an editable copy of the file. A new database will also be created on the server.
uk: Щоб використати цей файл резервної копії, ви маєте зберегти відкриту для редагування копію файлу. Нова база даних також буде створена на сервері.

source: Opening Read-Only File.
uk: Відкриття файлу лише для читання

source: This file is read only, so you will not be able to enter Developer mode to make design changes.
uk: Цей файл відкритий лише для читання, тому ви не зможете ввійти в режим Розробника і зробити зміни в дизайні.

source: _Cancel
uk: _Відмінити

source: Continue without Developer Mode
uk: Продовжити без режиму розробника

source: Database Not Found On Server
uk: База даних не знайдена на сервері

source: The database could not be found on the server. Please consult your system administrator.
uk: Базу даних не вдалося знайти на сервері. Зверніться до свого системного адміністратора.

source: Problem Loading Document
uk: Проблема із завантаженням документа

source: Glom could not load the document.
uk: Glom не вдалося завантажити документ.

source: Creating Glom database from example file.
uk: Створення бази даних Glom за допомогою файлу прикладу.

source: Creating Glom database from backup file.
uk: Створення бази даних Glom за допомогою файлу резервної копії.

source: Glom could not create the new database. Maybe you do not have the necessary access rights. Please contact your system administrator.
uk: Glom не вдалося створити нову базу даних. Можливо, ви не маєте достатніх прав доступу. Зв'яжіться з вашим системним адміністратором.

source: Database Creation Failed
uk: Помилка створення бази даних

source: Save failed.
uk: Збереження не вдалося.

source: There was an error while saving the example file.
uk: Під час збереження файлу прикладу сталася помилка.

source: Save Document
uk: Зберегти документ

source: _Save
uk: _Зберегти

source: Read-only File.
uk: Файл лише для читання.

source: You may not overwrite the existing file, because you do not have sufficient access rights.
uk: Ви не можете перезаписати наявний файл, оскільки ви не маєте достатніх прав доступу.

source: Read-only Directory.
uk: Каталог лише для читання.

source: You may not create a file in this directory, because you do not have sufficient access rights.
uk: Ви не можете створити файл в цьому каталозі, оскільки ви не маєте достатніх прав доступу.

source: Database Title missing
uk: Відсутній заголовок бази даних

source: You must specify a title for the new database.
uk: Ви маєте вказати заголовок для нової бази даних.

source: Directory Already Exists
uk: Каталог вже існує

source: There is an existing directory with the same name as the directory that should be created for the new database files. You should specify a different filename to use a new directory instead.
uk: Вже існує каталог з такою самою назвою, що і каталог, що має бути створений для нових файлів бази даних. Ви маєте вказати іншу назву файлу для того, щоб використати новий каталог.

source: Save Backup
uk: Зберегти резервну копію

source: Exporting backup
uk: Експортування резервної копії

source: Export Backup failed.
uk: Не вдалося експортувати резервну копію.

source: There was an error while exporting the backup.
uk: Під час експорту резервної копії сталася помилка.

source: Choose a backup file
uk: Оберіть файл резервної копії

source: .tar.gz Backup files
uk: Файли резервної копії .tar.gz

source: Restore
uk: Відновити

source: Restoring backup
uk: Відновлення резервної копії

source: Restore Backup failed.
uk: Не вдалося відновити резервну копію.

source: There was an error while extracting the backup.
uk: Під час розпакування резервної копії сталася помилка.

source: (read-only)
uk: (лише для читання)

source: Processing
uk: Обробка

source: Open Document
uk: Відкрити документ

source: _Open
uk: _Відкрити

source: Internal error
uk: Внутрішня помилка

source: Value Is Not Unique
uk: Значення не є унікальним

source: The field's value must be unique, but a record with this value already exists.
uk: Значення поля має бути унікальним, однак запис із таким значенням вже існує.

source: Data may not be entered into this related field, because the related record does not yet exist, and the relationship does not allow automatic creation of new related records.
uk: Неможливо ввести дані в це пов'язане поле, оскільки пов'язаний запис ще не існує, а зв'язок не дозволяє автоматично створювати нові пов'язані записи.

source: Related Record Does Not Exist
uk: Пов'язаний запис не існує

source: Data may not be entered into this related field, because the related record does not yet exist, and the key in the related record is auto-generated and therefore can not be created with the key value in this record.
uk: Неможливо ввести дані в це пов'язане поле, оскільки пов'язаний запис ще не існує, а ключ до пов'язаного запису генерується автоматично, і тому не може бути створений зі значенням ключа в цьому записі.

source: Related Record Cannot Be Created
uk: Неможливо створити пов'язаний запис

source: Are you sure that you would like to delete this record? The data in this record will then be permanently lost.
uk: Ви впевнені, що хочете вилучити цей запис? Дані цього запису будуть назавжди втрачені.

source: Delete record
uk: Вилучити запис

source: _Delete
uk: _Вилучити

source: Name
uk: Назва

source: This report already exists. Please choose a different report name
uk: Такий звіт вже існує. Оберіть іншу назву звіту

source: Title
uk: Заголовок

source: Are you sure that you want to rename this report?
uk: Ви впевнені, що хочете перейменувати цей звіт?

source: Rename Report
uk: Перейменувати звіт

source: Database user interface
uk: Інтерфейс користувача бази даних

source: With Glom you can design database systems - the database and the user interface.
uk: За допомогою Glom ви можете розробляти системи баз даних - базу даних та інтерфейс користувача.

source: Glom has high-level features such as relationships, lookups, related fields, related records, calculated fields, drop-down choices, searching, reports, users and groups. It has simple Numeric, Text, Date, Time, Boolean, and Image field types.
uk: Glom має такі функції високого рівня, як зв'язки, таблиці пошуку, пов'язані поля, пов'язані записи, обчислювані поля, спадні варіанти вибору, пошук, звіти, користувачі та групи. Програма має прості типи даних: Числовий, Текстовий, Дата, Час, Логічний, Зображення.

source: The details view showing the whole record
uk: Детальний перегляд, що відображає весь запис

source: The list view showing all records in the table
uk: Списковий перегляд, що відображає всі записи в таблиці

source: The details view showing records from a related table
uk: Детальний перегляд, що відображає записи із пов'язаної таблиці

source: A user-friendly database environment
uk: Зручне для користувача середовище баз даних

source: database;ui;tables;postgresql;forms;
uk: база даних;інтерфейс користувача;postgresql;форми;

source: Not yet created.
uk: Ще не створено.

source: No sessions found on the local network.
uk: Не знайдено сеансів у локальній мережі.

source: Open a Document
uk: Відкрити документ

source: Select File
uk: Обрати файл

source: Local Network
uk: Локальна мережа

source: Recently Opened
uk: Нещодавно відкриті

source: No recently used documents available.
uk: Немає нещодавніх документів.

source: New Empty Document
uk: Новий пустий документ

source: New From Template
uk: Новий із шаблону

source: %s on %s (via %s)
uk: %s на %s (через %s)

source: Export to File
uk: Експортувати в файл

source: Define Data _Format
uk: Визначити _формат даних

source: _Export
uk: _Експортувати

source: Find All
uk: Знайти всі

source: No Table Selected
uk: Не обрана таблиця

source: Quick _search:
uk: Швидкий _пошук:

source: _Find
uk: _Знайти

source: Records:
uk: Записи:

source: Found:
uk: Знайдено:

source: No table
uk: Немає таблиці

source: This database has no tables yet.
uk: В цій базі даних ще немає таблиць.

source: Developer mode not available.
uk: Режим розробника недоступний.

source: Developer mode is not available because the file was opened over the network from a running Glom. Only the original file may be edited.
uk: Режим розробника недоступний, оскільки файл був відкритий через мережу із запущеного Glom. Редагувати можливо лише оригінальний файл.

source: Developer mode not available
uk: Режим розробника недоступний

source: Developer mode is not available. Check that you have sufficient database access rights and that the glom file is not read-only.
uk: Режим розробника недоступний. Перевірте, чи маєте ви достатні права доступу і що файл glom не доступний лише для читання.

source: Saving in new document format
uk: Збереження у новому форматі документа

source: The document was created by an earlier version of the application. Making changes to the document will mean that the document cannot be opened by some earlier versions of the application.
uk: Документ був створений у попередній версії програми. Внесення змін до документа означатиме, що його неможливо буде відкрити деякими попередніми версіями програми.

source: Continue
uk: Продовжити

source: Export Not Allowed.
uk: Експорт не дозволено.

source: You do not have permission to view the data in this table, so you may not export the data.
uk: Ви не маєте дозволу на перегляд даних у цій таблиці, тому ви не можете експортувати дані.

source: Could Not Create File.
uk: Не вдалося створити файл.

source: Glom could not create the specified file.
uk: Glom не вдалося створити вказаний файл.

source: No Table
uk: Немає таблиці

source: There is no table in to which data could be imported.
uk: Немає таблиці, до якої можна імпортувати дані.

source: Open CSV Document
uk: Відкрити CSV-документ

source: CSV files
uk: CSV-файли

source: All files
uk: Усі файли

source: Share on the network
uk: Поділитися в мережі

source: This will allow other users on the network to use this database.
uk: Це дозволить іншим користувачам мережі використовувати цю базу даних.

source: _Share
uk: _Поділитися

source: Stop sharing on the network
uk: Припинити спільний доступ в мережі

source: This will prevent other users on the network from using this database.
uk: Це не дозволить іншим користувачам мережі використовувати цю базу даних.

source: _Stop Sharing
uk: _Припинити спільний доступ

source: Stopping Database Server
uk: Зупинка сервера баз даних

source: Starting Database Server
uk: Запуск сервера баз даних

source: Table Exists Already
uk: Таблиця вже існує

source: A table with this name already exists in the database. Please choose a different table name.
uk: Таблиця з такою назвою вже існує в базі даних. Оберіть іншу назву для таблиці.

source: Relationship Exists Already
uk: Зв'язок вже існує

source: A relationship with this name already exists for this table. Please choose a different relationship name.
uk: Зв'язок з такою назвою вже існує в таблиці. Оберіть іншу назву зв'язку.

source: More information needed
uk: Потрібна додаткова інформація

source: You must specify a field, a table name, and a relationship name.
uk: Ви маєте вказати поле, назву таблиці та назву зв'язку.

source: Related Table Created
uk: Створено пов'язану таблицю

source: The new related table has been created.
uk: Було створено нову пов'язану таблицю.

source: Edit Tables
uk: Редагувати таблиці

source: You have not entered any find criteria. Try entering information in the fields.
uk: Ви не ввели жодного критерію пошуку. Спробуйте ввести інформацію в поля.

source: No Find Criteria
uk: Немає критеріїв пошуку

source: Reports
uk: Звіти

source: Print Layouts
uk: Макети друку

source: Could Not Create Directory
uk: Не вдалося створити каталог

source: There was an error when attempting to create the directory for the new database files.
uk: Під час спроби створити каталог для нових файлів бази даних сталася помилка.

source: Could Not Start Database Server
uk: Не вдалося запустити сервер баз даних

source: There was an error when attempting to start the database server.
uk: Під час спроби запустити сервер баз даних сталася помилка.

source: Initializing Database Data
uk: Ініціалізація даних

source: All
uk: Всі

source: Could not display help: %1
uk: Не вдалося відобразити довідку: %1

source: Your find criteria did not match any records in the table.
uk: Ваші критерії пошуку не відповідають жодним записам у таблиці.

source: No Records Found
uk: Не знайдено записів

source: New Find
uk: Новий пошук

source: Report Finished
uk: Звіт закінчено

source: The report will now be opened in your web browser.
uk: Звіт буде відкрито в вашому веб-браузері.

source: Script Uses PyGTK 2
uk: Сценарій використовує PyGTK 2

source: Glom cannot run this script because it uses pygtk 2, but Glom uses GTK+ 3, and attempting to use pygtk 2 would cause Glom to crash.
uk: Glom не може запустити цей сценарій, оскільки він використовує pygtk 2, а Glom використовує GTK+ 3. Спроба використання pygtk 2 призведе до аварійного завершення Glom.

source: Search
uk: Пошук

source: Back to List
uk: Назад до списку

source: Details
uk: Деталі

source: Generating the report...
uk: Генерація звіту...

source: Login
uk: Вхід

source: Enter the username and password.
uk: Введіть ім'я користувача та пароль.

source: Username
uk: Ім'я користувача

source: Password
uk: Пароль

source: Log Out
uk: Вихід

source: The username or password are not correct.
uk: Ім'я користувача чи пароль неправильні.

source: Login seems to be necessary, but will not be attempted. This site is not being served via HTTPS, which is required for secure login. Please contact your system administrator.
uk: Здається, вхід необхідний, але спроба не здійснюватиметься. Цей сайт не обслуговується через HTTPS, що є необхідним для безпечного входу. Зверніться до свого системного адміністратора.

source: Register
uk: Реєстрація

source: Forgot Password
uk: Забули пароль

source: There was an error while saving the file. Your changes have not been saved.
uk: Під час збереження файлу сталася помилка. Ваші зміни не збережено.

source: Open Failed.
uk: Не вдалося відкрити.

source: The document could not be opened.
uk: Не вдалося відкрити документ.

source: This document has unsaved changes. Would you like to save the document?
uk: Цей документ має незбережені зміни. Чи хотіли б ви зберегти документ?

source: Document: %1
uk: Документ: %1

source: Close without Saving
uk: Закрити, не зберігаючи

source: Discard
uk: Відхилити

source: Auto Detect
uk: Автоматичне визначення

source: Note that the source file should contain numbers and dates in international ISO format. For instance, 22nd November 2008 should be %1.
uk: Зверніть увагу, що вихідний файл повинен містити цифри та дати у міжнародному форматі ISO. Наприклад, 22 Листопада 2008 року має бути записане як %1.

source: No Document Available
uk: Немає доступних документів

source: You need to open a document to import the data into a table.
uk: Вам потрібно відкрити документ, щоб імпортувати дані в таблицю.

source: Import From CSV File
uk: Імпорт з CSV-файлу

source: <None>
uk: <Немає>

source: Error Importing CSV File
uk: Помилка імпортування CSV-файлу

source: Encoding detected as: %1
uk: Кодування виявлено як: %1

source: Encoding detection failed. Please manually choose one from the box.
uk: Не вдалося виявити кодування. Виберіть його вручну.

source: The file contains data not in the specified encoding. Please choose another one, or try "Auto Detect".
uk: Файл містить дані, що не належать до вказаного кодування. Оберіть інше кодування або спробуйте автоматичне визначення.

source: Line
uk: Лінія

source: Target Field
uk: Цільове поле

source: <Import Failure>
uk: <Помилка імпорту>

source: <Picture>
uk: <Зображення>

source: One column needs to be assigned the table's primary key (<b>%1</b>) as target field before importing
uk: Одному стовпцю таблиці потрібно призначити первинний ключ (<b>%1</b>) як цільове поле перед імпортуванням

source: Could Not Open file
uk: Не вдалося відкрити файл

source: The file at "%1" could not be opened: %2
uk: Файл за шляхом "%1" не вдалося відкрити: %2

source: Import From CSV File: %1
uk: Імпорт з CSV-файлу: %1

source: Parsing CSV file %1
uk: Синтаксичний розбір CSV-файлу %1

source: Import complete
uk: Імпорт завершено

source: Warning: Importing row %1: The value for field %2 must be unique, but is already in use. The value will not be imported.
uk: Попередження: Імпортування рядка %1: Значення для поля %2 має бути унікальним, але вже використовується. Значення не буде імпортовано.

source: Warning: Importing row %1: The value for field %2, "%3" could not be converted to the field's type. The value will not be imported.
uk: Попередження: Імпортування рядка %1: Значення для поля %2, "%3" не вдалося перетворити на тип, вказаний для поля. Значення не буде імпортовано.

source: Error importing row %1: Cannot import the row because the primary key is empty.
uk: Помилка імпортування рядка %1: Імпорт рядка неможливий, оскільки первинний ключ порожній.

source: Unicode
uk: Юнікод

source: Western
uk: Західне

source: Central European
uk: Центральноєвропейське

source: South European
uk: Південноєвропейське

source: Baltic
uk: Балтійське

source: Cyrillic
uk: Кирилиця

source: Arabic
uk: Арабське

source: Greek
uk: Грецьке

source: Hebrew Visual
uk: Іврит візуальний

source: Hebrew
uk: Іврит

source: Turkish
uk: Турецьке

source: Nordic
uk: Скандинавське

source: Celtic
uk: Кельтське

source: Romanian
uk: Румунське

source: Vietnamese
uk: В'єтнамське

source: Invalid
uk: Недійсне

source: Number
uk: Числовий

source: Text
uk: Текстовий

source: Time
uk: Час

source: Date
uk: Дата

source: Boolean
uk: Логічний

source: Image
uk: Зображення

source: %x
uk: %d/%m/%Y

source: ERROR: sanity_check_date_parsing(): Sanity check failed: Glom could not parse a date's text representation that it generated itself, in this locale.
uk: ПОМИЛКА: sanity_check_date_parsing(): Помилка перевірки обґрунтованості: Glom не зміг проаналізувати текстове представлення дати, яке воно генерувало самостійно, у цій локалі.

source: ERROR: sanity_check_date_text_representation_uses_4_digit_year(): Sanity check failed: Glom does not seem to use 4 digits to display years in a date's text representation, in this locale. Defaulting to dd/mm/yyyy though this might be incorrect for your locale. This needs attention from a translator. Please file a bug - see http://www.glom.org
uk: ПОМИЛКА: sanity_check_date_text_representation_uses_4_digit_year(): Помилка перевірки обґрунтованості: Glom, здається, не використовує 4 цифри для відображення років у текстовому поданні дати в цій локалі. За замовчуванням є dd / mm / yyyy, хоча це може бути неправильним для вашої локалі. На це потрібно звернути увагу перекладача. Подайте помилку - див. http://www.glom.org

source: Group
uk: Група

source: Button
uk: Кнопка

source: Calendar Portal
uk: Портал календаря

source: Field
uk: Поле

source: Notebook
uk: Блокнот

source: Placeholder
uk: Заповнювач

source: Undefined Table
uk: Невизначена таблиця

source: Field Summary
uk: Підсумок поля

source: No summary chosen
uk: Не обрано підсумок

source: Sum
uk: Сума

source: Average
uk: Середнє значення

source: Count
uk: Кількість

source: Footer
uk: Нижній колонтитул

source: Group By
uk: Групування за

source: Header
uk: Верхній колонтитул

source: Summary
uk: Підсумок

source: Vertical Group
uk: Вертикальна група

source: Custom Title
uk: Власний заголовок

source: Relationship
uk: Зв'язок

source: Print Layout
uk: Макет друку

source: Report
uk: Звіт

source: Table
uk: Таблиця

source: Layout Item
uk: Елемент макета

source: Text Item
uk: Елемент тексту

source: Field Choice
uk: Поле з вибором

source: Database Title
uk: Заголовок бази даних

source: Unknown
uk: Невідомо

source: System Preferences
uk: Системні налаштування

source: System Name
uk: Назва системи

source: Organisation Name
uk: Назва організації

source: Organisation Logo
uk: Логотип організації

source: Street
uk: Вулиця

source: Street (line 2)
uk: Вулиця (рядок 2)

source: City
uk: Місто

source: State
uk: Штат

source: Country
uk: Країна

source: Zip Code
uk: Zip-Код

source: Overview
uk: Огляд

source: Untitled
uk: Без назви

source: Gettext-Warning:
uk: Gettext-попередження:

source: System: Auto Increments
uk: Система: автоматичне збільшення

source: Description
uk: Опис

source: Comments
uk: Коментарі

source: List
uk: Список

source: Glom options
uk: Параметри glom

source: Command-line options
uk: Параметри командного рядка

source: The example .glom file to open.
uk: Приклад .glom-файлу для відкриття.

source: The directory in which to save the created .glom file, or sub-directory if necessary, such as /home/someuser/ .
uk: Каталог для збереження створеного .glom-файлу, або підкаталог, якщо необхідно, наприклад /home/someuser/ .

source: The name for the created .glom file, such as something.glom .
uk: Назва для створеного .glom-файлу, наприклад something.glom .

source: The version of this application.
uk: Версія цієї програми.

source: The hostname of the PostgreSQL server, such as localhost. If this is not specified then a self-hosted database will be created.
uk: Ім'я хосту сервера PostgreSQL, наприклад localhost. Якщо це поле порожнє, то буде створено базу даних із самохостингом.
