Repository: Bot-wxt1221/glom
Catalog: po/*.po
Languages: uk

source: <b>Groups</b>
uk: <b>Групи</b>

source: <b>Tables</b>
uk: <b>Таблиці</b>

source: Image Object
uk: Об'єкт зображення

source: <b>Image:</b>
uk: <b>Зображення:</b>

source: C_hoose Image
uk: О_брати зображення

source: Page Set_up
uk: На_лаштування сторінки

source: Print Pre_view
uk: Попередній пере_гляд друку

source: Select _All
uk: Обрати _всі

source: _Unselect All
uk: _Скасувати вибір усіх

source: _Insert
uk: _Вставити

source: Insert _Field
uk: Вставити _поле

source: Insert _Text
uk: Вставити _текст

source: Insert _Image
uk: Вставити _зображення

source: Insert _Related Records
uk: Вставити _пов'язані зв'язки

source: Insert _Horizontal Line
uk: Вставити _горизонтальну лінію

source: Insert _Vertical Line
uk: Вставити _вертикальну лінію

source: Create _Standard
uk: Створити _стандарт

source: Add Page
uk: Додати сторінку

source: Delete Page
uk: Вилучити сторінку

source: _Align
uk: _Вирівняти

source: Align _Top
uk: Вирівняти з_верху

source: Align _Bottom
uk: Вирівняти з_низу

source: Align _Left
uk: Вирівняти за _лівим краєм

source: Align _Right
uk: Вирівняти за _правим краєм

source: _View
uk: _Переглянути

source: Show _Grid
uk: Показати _сітку

source: Show _Rules
uk: Показати _лінійки

source: Show _Outlines
uk: Показати _границі

source: Fit Page _Width
uk: Підібрати _ширину сторінки

source: Zoom 200%
uk: Збільшення 200%

source: Zoom 100%
uk: Збільшення 100%

source: Zoom 50%
uk: Збільшення 50%

source: Zoom 25%
uk: Збільшення 25%

source: Print Layout Editor
uk: Редактор макета друку

source: <b>Table Name</b>
uk: <b>Назва таблиці</b>

source: Layout name:
uk: Назва макета:

source: Width:
uk: Ширина:

source: Height:
uk: Висота:

source: Page _Setup
uk: _Налаштування сторінки

source: Edit _Fields
uk: Редагувати _поля

source: Edit _Relationships
uk: Редагувати _зв'язки

source: Relationships Overview
uk: Перегляд зв'язків

source: Report Layout
uk: Макет звіту

source: _Show table title
uk: _Показати заголовок таблиці

source: When this is checked the table's title will be shown at the top of the report in addition to the report title.
uk: Якщо це позначено, заголовок таблиці відображатиметься вгорі звіту на додаток до заголовку звіту.

source: _Report name:
uk: Назва _звіту:

source: <b>Available Parts</b>
uk: <b> Доступні частини</b>

source: Main
uk: Головна

source: <b>Parts</b>
uk: <b>Частини</b>

source: Text Format
uk: Формат тексту

source: <b>Text:</b>
uk: <b>Текст:</b>

source: Translations
uk: Переклади

source: <b>Source Language:</b>
uk: <b>Мова джерела:</b>

source: English
uk: Англійська

source: Identify Source
uk: Визначте джерело

source: <b>Target Language:</b>
uk: <b>Мова перекладу:</b>

source: Copy From Existing Translation
uk: Скопіювати з наявного перекладу

source: Start a translation for this target locale by copying the strings from another target locale.
uk: Почати переклад для обраної локалі, скопіювавши рядки з іншої локалі.

source: <b>Group:</b>
uk: <b>Група:</b>

source: <b>Users</b>
uk: <b>Користувачі</b>
